000010******************************************************************23.05.16
000011*                                                                *23.05.16
000012*  PROGRAMA          : DSPCUTRE                                  *23.05.16
000013*  FECHA DE CREACION : 15/02/2022                                *23.05.16
000014*  AUTOR             : NTT DATA                                  *23.05.16
000015*  DESCRIPCION       : OBTIENE FICHERO DE RECIBOS PARA TIREA     *23.05.16
000016******************************************************************23.05.16
000017* FUNCIONES: ESTE PROGRAMA GENERARá UN FICHERO DE RECIBOS PARA   *23.05.16
000018*            TIREA                                               *23.05.16
000019******************************************************************23.05.16
000020*                                                                *23.05.16
000021******************************************************************23.05.16
000022*               LOG DE MODIFICACIONES DEL SOFTWARE               *23.05.16
000023******************************************************************23.05.16
000024*                                                                 23.05.16
000025* L-0001 - MODIFICACION SERGIO                                    23.05.16
000026*                                                                 23.05.16
000027* L-0002    USUARIO: NTTDATA      FECHA: 27-12-2022               23.05.16
000028* DESCRIPCION: SE AÑADE EL REGISTO CABECERA                       23.05.16
000029******************************************************************23.05.16
000030* L-0003    USUARIO: NTTDATA      FECHA: 08-03-2023              *23.05.16
000031* DESCRIPCION: SE MODIFICA SELECT TABLA ACX PARA IR POR CLAVE    *23.05.16
000032*              COD_COLECTPC = 0                                   23.05.16
000033******************************************************************23.05.16
000034* L-0004    USUARIO: NPC        FECHA: 27-03-2023                *23.05.16
000035* DESCRIPCION: SE AÑADEN LOS PRODUCTOS 7091 Y 7092                23.05.16
000036******************************************************************23.05.16
000037* L-0005    USUARIO: NPC        FECHA: 16-05-2023                *23.05.16
000038* DESCRIPCION: CORRECCION DESCUADRE                              *23.05.16
000036******************************************************************23.05.16
000037*         I D E N T I F I C A T I O N   D I V I S I O N          *23.05.16
000038*             INFORMACION GENERAL SOBRE EL PROGRAMA              *23.05.16
000039******************************************************************23.05.16
000040                                                                  23.05.16
000041 IDENTIFICATION DIVISION.                                         23.05.16
000042                                                                  23.05.16
000043 PROGRAM-ID.   DSPCUTRE.                                          23.05.16
000044 AUTHOR.       NTT DATA.                                          23.05.16
000045 DATE-WRITTEN. 07-03-22.                                          23.05.16
000046                                                                  23.05.16
000047******************************************************************23.05.16
000048*        E N V I R O N M E N T         D I V I S I O N           *23.05.16
000049*                                                                *23.05.16
000050*     DESCRIPCION DEL ENTORNO Y ESPECIFICACIONES INICIALES       *23.05.16
000051******************************************************************23.05.16
000052                                                                  23.05.16
000053 ENVIRONMENT DIVISION.                                            23.05.16
000054                                                                  23.05.16
000055 CONFIGURATION SECTION.                                           23.05.16
000056                                                                  23.05.16
000057 SPECIAL-NAMES.                                                   23.05.16
000058     DECIMAL-POINT IS COMMA.                                      23.05.16
000059                                                                  23.05.16
000060 INPUT-OUTPUT SECTION.                                            23.05.16
000061                                                                  23.05.16
000062 FILE-CONTROL.                                                    23.05.16
000063                                                                  23.05.16
000064******************************************************************23.05.16
000065*                FICHERO DE ENTRADA 1  POLIZAS                   *23.05.16
000066******************************************************************23.05.16
000067     SELECT FPCRECE1  ASSIGN TO FPCRECE1                          23.05.16
000068     ORGANIZATION IS SEQUENTIAL                                   23.05.16
000069     ACCESS MODE IS SEQUENTIAL                                    23.05.16
000070     FILE STATUS IS FS-FPCRECE1.                                  23.05.16
000071                                                                  23.05.16
000072******************************************************************23.05.16
000073*                FICHERO DE SALIDA  1  RECIBOS PARA TIREA        *23.05.16
000074******************************************************************23.05.16
000075     SELECT FPCRECS1  ASSIGN TO FPCRECS1                          23.05.16
000076     ORGANIZATION IS SEQUENTIAL                                   23.05.16
000077     ACCESS MODE IS SEQUENTIAL                                    23.05.16
000078     FILE STATUS IS FS-FPCRECS1.                                  23.05.16
000079                                                                  23.05.16
000080******************************************************************23.05.16
000081*                FICHERO DE INCIDENCIAS                          *23.05.16
000082******************************************************************23.05.16
000083     SELECT FPCRECL1  ASSIGN TO FPCRECL1                          23.05.16
000084     ORGANIZATION IS SEQUENTIAL                                   23.05.16
000085     ACCESS MODE IS SEQUENTIAL                                    23.05.16
000086     FILE STATUS IS FS-FPCRECL1.                                  23.05.16
000087                                                                  23.05.16
000088 DATA DIVISION.                                                   23.05.16
000089                                                                  23.05.16
000090 FILE SECTION.                                                    23.05.16
000091                                                                  23.05.16
000092******************************************************************23.05.16
000093*                 FD DEL FICHERO DE ENTRADA 1                    *23.05.16
000094******************************************************************23.05.16
000095 FD FPCRECE1                                                      23.05.16
000096     RECORDING MODE IS F                                          23.05.16
000097     LABEL RECORDS STANDARD                                       23.05.16
000098     DATA RECORD IS REG-FPCRECE1                                  23.05.16
000099     BLOCK CONTAINS 0 RECORDS.                                    23.05.16
000100 01 REG-FPCRECE1                 PIC X(223).                      23.05.16
000101                                                                  23.05.16
000102******************************************************************23.05.16
000103*                 FD DEL FICHERO DE SALIDA  1                    *23.05.16
000104******************************************************************23.05.16
000105 FD FPCRECS1                                                      23.05.16
000106     RECORDING MODE IS F                                          23.05.16
000107     LABEL RECORDS STANDARD                                       23.05.16
000108     DATA RECORD IS REG-FPCRECS1                                  23.05.16
000109     BLOCK CONTAINS 0 RECORDS.                                    23.05.16
000110 01 REG-FPCRECS1                 PIC X(705).                      23.05.16
000111                                                                  23.05.16
000112******************************************************************23.05.16
000113*                 FD DEL FICHERO DE INCIDENCIAS                  *23.05.16
000114******************************************************************23.05.16
000115 FD FPCRECL1                                                      23.05.16
000116     RECORDING MODE IS F                                          23.05.16
000117     LABEL RECORDS STANDARD                                       23.05.16
000118     DATA RECORD IS REG-FPCRECL1                                  23.05.16
000119     BLOCK CONTAINS 0 RECORDS.                                    23.05.16
000120 01 REG-FPCRECL1                 PIC X(290).                      23.05.16
000121                                                                  23.05.16
000122******************************************************************23.05.16
000123*              WORKING-STORAGE SECTION                           *23.05.16
000124******************************************************************23.05.16
000125                                                                  23.05.16
000126 WORKING-STORAGE SECTION.                                         23.05.16
      *INC AUDIT. NO BORRAR DESDE AQUI HASTA FIN INCLUDE                        
       77 AUDIT-TRAIL PIC X(60) VALUE                                           
           '[** AUDIT ** DSPCUTRE-XE95753-230522-184519-             ]'.        
      *FIN INC AUDIT.                                                           
000131                                                                  23.05.16
000132******************************************************************23.05.16
000133*                         AREA DE COPYS                          *23.05.16
000134******************************************************************23.05.16
000135                                                                  23.05.16
000136                                                                  23.05.16
000137*--------------- COPY DE RETORNO GENERAL DE ERRORES--------------*23.05.16
000138 COPY CDSPCRT2.                                                   23.05.16
000139                                                                  23.05.16
000140*--------------- COPY DEL FICHERO DE ENTRADA E1------------------*23.05.16
000141 COPY CDSPCTR1.                                                   23.05.16
000142                                                                  23.05.16
000143***************************************************************** 23.05.16
000144* COPY DE CONSTANTES                                              23.05.16
000145***************************************************************** 23.05.16
000146 COPY CDSPCCTE.                                                   23.05.16
000147*                                                                 23.05.16
000148***************************************************************** 23.05.16
000149*-- COPY DEL MODULO CTR CONSULTA DE TABLAS DE FECHAS              23.05.16
000150***************************************************************** 23.05.16
000151 COPY CDSPCCTR.                                                   23.05.16
000152*                                                                 23.05.16
000153***************************************************************** 23.05.16
000154* COPY DEL MODULO QPIPRX37                                        23.05.16
000155***************************************************************** 23.05.16
000156 COPY QPIPCX37.                                                   23.05.16
000157*COPY DEL AREA DE ERRORES                                         23.05.16
000158 COPY QPIPCCAB.                                                   23.05.16
000159*                                                                 23.05.16
000160                                                                  23.05.16
000161* COPYS DE AIS DATOS RECIBOS                                      23.05.16
000162     COPY KAELDCII.                                               23.05.16
000163 01 PARAM-I.                                                      23.05.16
000164     COPY KAELIC00.                                               23.05.16
000165     COPY KRBLIC51.                                               23.05.16
000166 01 PARAM-V.                                                      23.05.16
000167     COPY KAELVC00.                                               23.05.16
000168     COPY KRBLVC51.                                               23.05.16
000169                                                                  23.05.16
000170***************************************************************** 23.05.16
000171* GESTION DE ERRORES BATCH                                        23.05.16
000172***************************************************************** 23.05.16
000173 COPY QPBTCXRR.                                                   23.05.16
000174*                                                                 23.05.16
000175***************************************************************** 23.05.16
000176* COPY FICHERO DE SALIDA 1                                        23.05.16
000177***************************************************************** 23.05.16
000178 COPY CDSPCTRE.                                                   23.05.16
000179                                                                  23.05.16
000180                                                                  23.05.16
000181*                                                                 23.05.16
000182******************************************************************23.05.16
000183*                   SQL                                          *23.05.16
000184******************************************************************23.05.16
000185                                                                  23.05.16
000186     EXEC SQL                                                     23.05.16
000187         INCLUDE SQLCA                                            23.05.16
000188     END-EXEC.                                                    23.05.16
000189                                                                  23.05.16
000190*CABECERA-COASEGURO                                               23.05.16
000191     EXEC SQL                                                     23.05.16
000192         INCLUDE TDSPCCPX                                         23.05.16
000193     END-EXEC.                                                    23.05.16
000194                                                                  23.05.16
000195*CUADRO-COASEGURO                                                 23.05.16
000196     EXEC SQL                                                     23.05.16
000197         INCLUDE TDSPCCQX                                         23.05.16
000198     END-EXEC.                                                    23.05.16
000199                                                                  23.05.16
000200*PRESTACIONES-GAR-COL                                             23.05.16
000201     EXEC SQL                                                     23.05.16
000202         INCLUDE TDSPCCDX                                         23.05.16
000203     END-EXEC.                                                    23.05.16
000204                                                                  23.05.16
000205*INTERVINIENTES                                                   23.05.16
000206     EXEC SQL                                                     23.05.16
000207         INCLUDE TDSPCCKX                                         23.05.16
000208     END-EXEC.                                                    23.05.16
000209                                                                  23.05.16
000210*AJUSTES                                                          23.05.16
000211     EXEC SQL                                                     23.05.16
000212         INCLUDE TDSPCAAX                                         23.05.16
000213     END-EXEC.                                                    23.05.16
000214                                                                  23.05.24
000215*POLIZA-SUPLEMENTO                                                23.05.24
000216     EXEC SQL                                                     23.05.24
000217         INCLUDE TDSPCZFX                                         23.05.24
000218     END-EXEC.                                                    23.05.24
000219                                                                  23.05.24
000215* RECIBOS                                                         23.05.16
000216     EXEC SQL                                                     23.05.16
000217         INCLUDE TDSPCFAX                                         23.05.16
000218     END-EXEC.                                                    23.05.16
000219                                                                  23.05.16
000220* PRIMAS                                                          23.05.16
000221     EXEC SQL                                                     23.05.16
000222         INCLUDE TDSPCACX                                         23.05.16
000223     END-EXEC.                                                    23.05.16
000224                                                                  23.05.16
000225* PRIMAS                                                          23.05.16
000226     EXEC SQL                                                     23.05.16
000227         INCLUDE TDSPCCAX                                         23.05.16
000228     END-EXEC.                                                    23.05.16
000229                                                                  23.05.16
000230                                                                  23.05.16
000231******************************************************************23.05.16
000232*                   CURSORES   .                                 *23.05.16
000233******************************************************************23.05.16
000234     EXEC SQL                                                     23.05.16
000235         DECLARE CURSOR-COASEG CURSOR FOR                         23.05.16
000236           SELECT                                                 23.05.16
000237              COD_COASEG,                                         23.05.16
000238              POR_PARTIC,                                         23.05.16
000239              POR_DISTGINT                                        23.05.16
000240           FROM TDSPCCQX                                          23.05.16
000241           WHERE                                                  23.05.16
000242              COD_BANCO     = :CQX-COD-BANCO    AND               23.05.16
000243              COD_ORDENCOA  = :CQX-COD-ORDENCOA AND               23.05.16
000244              XTI_ESTADOT   = :LIT-VI           AND               23.05.16
000245              COD_CUADRO    = :CQX-COD-CUADRO                     23.05.16
000246      END-EXEC.                                                   23.05.25
000247                                                                  23.05.25
000248     EXEC SQL                                                     23.05.25
000249         DECLARE CURSOR-ZFX CURSOR FOR                            23.05.25
000250           SELECT                                                 23.05.25
000251              COD_SUPLEMEN                                        23.05.25
000254           FROM TDSPCZFX                                          23.05.25
000255           WHERE                                                  23.05.25
000256              COD_BANCO     = :ZFX-COD-BANCO    AND               23.05.25
000257              COD_POLIZPSC  = :ZFX-COD-POLIZPSC AND               23.05.25
000258              FEC_FACTURPC  = :ZFX-FEC-FACTURPC                   23.05.25
000257      END-EXEC.                                                   23.05.25
000247******************************************************************23.05.16
000248*                   FILE STATUS.                                 *23.05.16
000249******************************************************************23.05.16
000250                                                                  23.05.16
000251 01  FS-FILE-STATUS.                                              23.05.16
000252     05  FS-FPCRECE1             PIC X(2)        VALUE '00'.      23.05.16
000253     05  FS-FPCRECS1             PIC X(2)        VALUE '00'.      23.05.16
000254     05  FS-FPCRECL1             PIC X(2)        VALUE '00'.      23.05.16
000255                                                                  23.05.16
000256***************************************************************** 23.05.16
000257*                           CLAVES                              * 23.05.16
000258***************************************************************** 23.05.16
000259 01  CLAVES.                                                      23.05.16
000260    10 CLAVE-1.                                                   23.05.16
000261       15 CLV1-BANCO                 PIC 9(4).                    23.05.16
000262       15 CLV1-POLIZA                PIC 9(8).                    23.05.16
000263*                                                                 23.05.16
000264                                                                  23.05.16
000265******************************************************************23.05.16
000266*                       AREA  DE SWITCHES                        *23.05.16
000267******************************************************************23.05.16
000268                                                                  23.05.16
000269 01  SW-SWITCHES.                                                 23.05.16
000270     05  SW-FIN-ENTRADA1               PIC X(1)  VALUE 'N'.       23.05.16
000271         88  FIN-ENTRADA1                        VALUE 'S'.       23.05.16
000272         88  NO-FIN-ENTRADA1                     VALUE 'N'.       23.05.16
000273                                                                  23.05.16
000274     05  SW-ERROR-GRAVE                PIC X(1)  VALUE 'N'.       23.05.16
000275         88  NO-ERROR-GRAVE                      VALUE 'N'.       23.05.16
000276         88  SI-ERROR-GRAVE                      VALUE 'S'.       23.05.16
000277                                                                  23.05.16
000278     05  SW-FIN-CURSOR-COASEG          PIC X.                     23.05.16
000279         88 FIN-CURSOR-COASEG                    VALUE 'S'.       23.05.16
000280         88 NO-FIN-CURSOR-COASEG                 VALUE 'N'.       23.05.16
000281                                                                  23.05.25
000282     05  SW-FIN-CURSOR-ZFX             PIC X.                     23.05.25
000283         88 FIN-CURSOR-ZFX                       VALUE 'S'.       23.05.25
000284         88 NO-FIN-CURSOR-ZFX                    VALUE 'N'.       23.05.25
000285                                                                  23.05.25
000286     05  SW-FIN-CURSOR-INTERES         PIC X.                     23.05.25
000283         88 FIN-CURSOR-INTERES                   VALUE 'S'.       23.05.16
000284         88 NO-FIN-CURSOR-INTERES                VALUE 'N'.       23.05.16
000285                                                                  23.05.16
000286     05  SW-RENTAS                     PIC X(1)  VALUE 'N'.       23.05.16
000287         88 SI-RENTAS                            VALUE 'S'.       23.05.16
000288         88 NO-RENTAS                            VALUE 'N'.       23.05.16
000289                                                                  23.05.16
000290     05  SW-AHORRO                     PIC X(1)  VALUE 'N'.       23.05.16
000291         88 SI-AHORRO                            VALUE 'S'.       23.05.16
000292         88 NO-AHORRO                            VALUE 'N'.       23.05.16
000293                                                                  23.05.16
000294     05  SW-MANUAL                     PIC X(1)  VALUE 'N'.       23.05.16
000295         88 SI-MANUAL                            VALUE 'S'.       23.05.16
000296         88 NO-MANUAL                            VALUE 'N'.       23.05.16
000297                                                                  23.05.16
000298******************************************************************23.05.16
000299*                AREA DE CONSTANTES NUMERICAS                    *23.05.16
000300******************************************************************23.05.16
000301                                                                  23.05.16
000302 01  CTE-CONSTANTES.                                              23.05.16
000303     05  CTE-SUMA-1              PIC S9(9) COMP-3                 23.05.16
000304                                                 VALUE +1.        23.05.16
000305     05  CTE-1                   PIC 9(1) COMP   VALUE 1.         23.05.16
000306     05  CTN-0                   PIC 9(1)        VALUE 0.         23.05.16
000307     05  CTE-QPIPRX37            PIC X(8)        VALUE 'QPIPRX37'.23.05.16
000308     05  CTE-BATCH               PIC X(5)        VALUE 'BATCH'.   23.05.16
000309     05  CTE-SYSTEM              PIC X(6)        VALUE 'SYSTEM'.  23.05.16
000310     05  CTE-1C                  PIC 9(01)       VALUE 1 COMP.    23.05.16
000311     05  CTE-2C                  PIC 9(04)       VALUE 2 COMP.    23.05.16
000312     05  CTE-DOS                 PIC 9           VALUE 2.         23.05.16
000313     05  CTE-3-ESPACIOS          PIC X(3)        VALUE '   '.     23.05.16
000314     05  CTE-KAELMDCI            PIC X(8)        VALUE 'KAELMDCI'.23.05.16
000315     05  CTE-KRBLMC51            PIC X(8)        VALUE 'KRBLMC51'.23.05.16
000316     05  CTE-NP                  PIC X(2)        VALUE 'NP'.      23.05.16
000317     05  CTE-PR                  PIC X(2)        VALUE 'PR'.      23.05.16
000318     05  CTE-A                   PIC X(1)        VALUE 'A'.       23.05.16
000319     05  CTE-01                  PIC X(3)        VALUE '001'.     23.05.16
000320     05  CTE-02                  PIC X(3)        VALUE '002'.     23.05.16
000321     05  CTE-04                  PIC X(3)        VALUE '004'.     23.05.19
000322     05  CTE-08                  PIC X(3)        VALUE '008'.     23.05.19
000323     05  CTE-24                  PIC X(3)        VALUE '024'.     23.05.19
000323     05  CTE-025                 PIC X(3)        VALUE '025'.     23.05.19
000322     05  CTE-30                  PIC X(3)        VALUE '030'.     23.05.19
000322*L-0002-INI                                                       23.05.16
000323     05  CTE-T                   PIC X(02)       VALUE 'T'.       23.05.16
000324     05  CTE-PUNTOS              PIC X(01)       VALUE ':'.       23.05.16
000325*L-0002-FIN                                                       23.05.16
000326                                                                  23.05.16
000327******************************************************************23.05.16
000328*                AREA DE LITERALES                               *23.05.16
000329******************************************************************23.05.16
000330                                                                  23.05.16
000331 01  LIT-LITERALES.                                               23.05.16
000332     05  LIT-ALPHA-1             PIC X(1)        VALUE '1'.       23.05.16
000333     05  LIT-E                   PIC X(1)        VALUE 'E'.       23.05.16
000334*L-0001-INI                                                       23.05.16
000335     05  LIT-5E                  PIC X(1)        VALUE X'5E'.     23.05.16
000336     05  LIT-ESPACIO             PIC X(1)        VALUE ' '.       23.05.16
000337*L-0001-FIN                                                       23.05.16
000338     05  LIT-BT                  PIC X(2)        VALUE 'BT'.      23.05.16
000339     05  LIT-NP                  PIC X(2)        VALUE 'NP'.      23.05.16
000340     05  LIT-BC                  PIC X(2)        VALUE 'BC'.      23.05.16
000341     05  LIT-CD                  PIC X(2)        VALUE 'CD'.      23.05.16
000342     05  LIT-PO                  PIC X(2)        VALUE 'PO'.      23.05.16
000343     05  LIT-AT                  PIC X(2)        VALUE 'AT'.      23.05.16
000344     05  LIT-NB                  PIC X(2)        VALUE 'NB'.      23.05.16
000345     05  LIT-NM                  PIC X(2)        VALUE 'NM'.      23.05.16
000346     05  LIT-DGS                 PIC X(3)        VALUE 'DGS'.     23.05.16
000347     05  LIT-2-1                 PIC X(3)        VALUE '2.1'.     23.05.16
000348     05  LIT-2-2                 PIC X(3)        VALUE '2.2'.     23.05.19
000349     05  LIT-2-3                 PIC X(3)        VALUE '2.3'.     23.05.19
000350     05  LIT-2-4                 PIC X(3)        VALUE '2.4'.     23.05.19
000349     05  LIT-MANU                PIC X(4)        VALUE 'MANU'.    23.05.16
000350     05  LIT-PROGRAMA            PIC X(8)        VALUE 'DSPCUTRE'.23.05.16
000351     05  LIT-QPBTRXRR            PIC X(08)       VALUE 'QPBTRXRR'.23.05.16
000352     05  LIT-TDSPCCPX            PIC X(8)        VALUE 'TDSPCCPX'.23.05.16
000353     05  LIT-TDSPCCKX            PIC X(8)        VALUE 'TDSPCCKX'.23.05.16
000354     05  LIT-TDSPCFAX            PIC X(8)        VALUE 'TDSPCFAX'.23.05.16
000355     05  LIT-TDSPCCDX            PIC X(8)        VALUE 'TDSPCCDX'.23.05.16
000356     05  LIT-TDSPCCQX            PIC X(8)        VALUE 'TDSPCCQX'.23.05.16
000357     05  LIT-TDSPCACX            PIC X(8)        VALUE 'TDSPCACX'.23.05.16
000358     05  LIT-TDSPCCAX            PIC X(8)        VALUE 'TDSPCCAX'.23.05.16
000359     05  LIT-TDSPCZFX            PIC X(8)        VALUE 'TDSPCZFX'.23.05.25
000360                                                                  23.05.25
000360     05  LIT-RECIBO              PIC X(06)       VALUE 'RECIBO'.  23.05.16
000361     05  LIT-RECIBO-CES          PIC X(13)       VALUE            23.05.16
000362                             'RECIBO-CESION'.                     23.05.16
000363     05  LIT-111                 PIC X(3)        VALUE '111'.     23.05.19
000365     05  LIT-121                 PIC X(3)        VALUE '121'.     23.05.16
000366     05  LIT-RN                  PIC X(02)       VALUE 'RN'.      23.05.16
000367     05  LIT-CA                  PIC X(02)       VALUE 'CA'.      23.05.16
000368     05  LIT-RENTAS              PIC X(06)       VALUE 'RENTAS'.  23.05.16
000369     05  LIT-AHORRO              PIC X(06)       VALUE 'AHORRO'.  23.05.16
000370     05  LIT-PARCIAL             PIC X(07)       VALUE 'PARCIAL'. 23.05.16
000371     05  LIT-BACK                PIC X(04)       VALUE 'BACK'.    23.05.16
000372     05  LIT-NEW-PRODUCTION      PIC X(14)       VALUE            23.05.16
000373                                   'NEW-PRODUCTION'.              23.05.16
000374     05  LIT-WALLET              PIC X(06)       VALUE 'WALLET'.  23.05.16
000375     05  LIT-EUR                 PIC X(03)       VALUE 'EUR'.     23.05.16
000376     05  LIT-FS                  PIC X(06)       VALUE ', FS: '.  23.05.16
000377     05  LIT-FS-00               PIC X(2)        VALUE '00'.      23.05.16
000378     05  LIT-NO-ERROR            PIC X(4)        VALUE '0000'.    23.05.16
000379     05  LIT-APLICACION          PIC X(04)       VALUE 'DSPC'.    23.05.16
000380     05  LIT-DB2                 PIC X(03)       VALUE 'DB2'.     23.05.16
000381     05  LIT-S                   PIC X(01)       VALUE 'S'.       23.05.16
000382     05  LIT-F                   PIC X(01)       VALUE 'F'.       23.05.16
000383     05  LIT-VI                  PIC X(02)       VALUE 'VI'.      23.05.16
000384     05  LIT-TO                  PIC X(02)       VALUE 'TO'.      23.05.16
000385     05  LIT-TRANSF              PIC X(06)       VALUE 'TRANSF'.  23.05.16
000386     05  LIT-C0031               PIC X(05)       VALUE 'C0031'.   23.05.16
000387     05  LIT-C0037               PIC X(05)       VALUE 'C0037'.   23.05.16
000388     05  LIT-C0072               PIC X(05)       VALUE 'C0072'.   23.05.16
000389     05  LIT-C0502               PIC X(05)       VALUE 'C0502'.   23.05.16
000390     05  LIT-C0511               PIC X(05)       VALUE 'C0511'.   23.05.16
000391     05  LIT-C0517               PIC X(05)       VALUE 'C0517'.   23.05.16
000392     05  LIT-C0611               PIC X(05)       VALUE 'C0611'.   23.05.16
000393     05  LIT-C0711               PIC X(05)       VALUE 'C0711'.   23.05.16
000394     05  LIT-C0744               PIC X(05)       VALUE 'C0744'.   23.05.16
000395     05  LIT-C0789               PIC X(05)       VALUE 'C0789'.   23.05.16
000396     05  LIT-C9999               PIC X(05)       VALUE 'C9999'.   23.05.16
000397*L-0002-INI                                                       23.05.16
000398     05  LIT-FICHERO             PIC X(07)       VALUE 'FICHERO'. 23.05.16
000399     05  LIT-T0000               PIC X(05)       VALUE 'T0000'.   23.05.16
000400*L-0002-FIN                                                       23.05.16
000401                                                                  23.05.16
000402     05  LIT-COASEG-BBVA         PIC X(10)       VALUE            23.05.16
000403                                   '0000010008'.                  23.05.16
000404     05  LIT-COASEG-VITALICIO    PIC X(10)       VALUE            23.05.16
000405                                   '0000010001'.                  23.05.16
000406     05  LIT-COASEG-REUNIDOS     PIC X(10)       VALUE            23.05.16
000407                                   '0000010004'.                  23.05.16
000408     05  LIT-COASEG-MAPFRE       PIC X(10)       VALUE            23.05.16
000409                                   '0000010005'.                  23.05.16
000410     05  LIT-COASEG-ULTRA        PIC X(10)       VALUE            23.05.16
000411                                   '0000010006'.                  23.05.16
000412     05  LIT-COASEG-SANTANDER    PIC X(10)       VALUE            23.05.16
000413                                   '0000010007'.                  23.05.16
000414     05  LIT-COASEG-AXA          PIC X(10)       VALUE            23.05.16
000415                                   '0000010009'.                  23.05.16
000416     05  LIT-COASEG-VIDACAIXA    PIC X(10)       VALUE            23.05.16
000417                                   '0000010010'.                  23.05.16
000418     05  LIT-COASEG-MUSINI       PIC X(10)       VALUE            23.05.16
000419                                   '0000010011'.                  23.05.16
000420     05  LIT-COASEG-AEGON        PIC X(10)       VALUE            23.05.16
000421                                   '0001960629'.                  23.05.16
000422     05  LIT-COASEG-GENERALI     PIC X(10)       VALUE            23.05.16
000423                                   '0005423966'.                  23.05.16
000424     05  LIT-COASEG-ATLANTIS     PIC X(10)       VALUE            23.05.16
000425                                   '0005866094'.                  23.05.16
000426                                                                  23.05.16
000427                                                                  23.05.16
000428     05  LIT-OPEN                PIC X(04)       VALUE 'OPEN'.    23.05.16
000429     05  LIT-READ                PIC X(04)       VALUE 'READ'.    23.05.16
000430     05  LIT-CLOSE               PIC X(05)       VALUE 'CLOSE'.   23.05.16
000431     05  LIT-WRITE               PIC X(05)       VALUE 'WRITE'.   23.05.16
000432     05  LIT-1200                PIC X(19)       VALUE            23.05.16
000433                                   '1200-ABRIR-FICHEROS'.         23.05.16
000434     05  LIT-3100                PIC X(20)       VALUE            23.05.16
000435                                   '3100-CERRAR-FICHEROS'.        23.05.16
000436     05  LIT-6300                PIC X(17)       VALUE            23.05.16
000437                                   '6300-GRABAR-ERROR'.           23.05.16
000438     05  LIT-2000                PIC X(12)       VALUE            23.05.16
000439                                  '2000-PROCESO'.                 23.05.16
000440     05  LIT-2600                PIC X(24)       VALUE            23.05.16
000441                                  '2600-PROCESO-SUPLEMENTO'.      23.05.16
000442     05  LIT-2025                PIC X(24)       VALUE            23.05.16
000443                                  '2050-OBTENER-CABCOASE'.        23.05.16
000444     05  LIT-2050                PIC X(24)       VALUE            23.05.16
000445                                  '2050-OBTENER-ORDENCOA'.        23.05.16
000446     05  LIT-2215                PIC X(19)       VALUE            23.05.16
000447                                  '2215-PROCESO-CURSOR'.          23.05.16
000448     05  LIT-2650                PIC X(26)       VALUE            23.05.16
000449                                  '2650-OBTENER-DATOS-FAX'.       23.05.25
000450     05  LIT-2652                PIC X(26)       VALUE            23.05.25
000451                                  '2652-OBTENER-DATOS-ZFX'.       23.05.25
000452     05  LIT-2655                PIC X(26)       VALUE            23.05.25
000451                                  '2650-OBTENER-DATOS-ACX'.       23.05.16
000452     05  LIT-2300                PIC X(24)       VALUE            23.05.16
000453                                  '2300-TIPO-GARANTIA'.           23.05.16
000454     05  LIT-FPCRECE1            PIC X(8)        VALUE 'FPCRECE1'.23.05.16
000455     05  LIT-FPCRECS1            PIC X(8)        VALUE 'FPCRECS1'.23.05.16
000456     05  LIT-FPCRECL1            PIC X(8)        VALUE 'FPCRECL1'.23.05.16
000457     05  LIT-DES-FPCRECS1                                         23.05.16
000458          PIC X(26) VALUE 'FICHERO DE SALIDA FPCRECS1'.           23.05.16
000459     05  LIT-DES-FPCRECL1                                         23.05.16
000460          PIC X(26) VALUE 'FICHERO DE SALIDA FPCRECL1'.           23.05.16
000461     05  LIT-ERROR-APERTURA1     PIC X(34)       VALUE            23.05.16
000462                        'ERROR ABRIENDO DE FICHERO FPCRECE1'.     23.05.16
000463     05  LIT-ERROR-APERTURA3     PIC X(34)       VALUE            23.05.16
000464                        'ERROR ABRIENDO DE FICHERO FPCRECS1'.     23.05.16
000465     05  LIT-ERROR-APERTURA4     PIC X(34)       VALUE            23.05.16
000466                        'ERROR ABRIENDO DE FICHERO FPCRECL1'.     23.05.16
000467     05  LIT-ERROR-CERRAR1       PIC X(34)       VALUE            23.05.16
000468                        'ERROR CERRANDO DE FICHERO FPCRECE1'.     23.05.16
000469     05  LIT-ERROR-CERRAR3       PIC X(34)       VALUE            23.05.16
000470                        'ERROR CERRANDO DE FICHERO FPCRECS1'.     23.05.16
000471     05  LIT-ERROR-CERRAR4       PIC X(34)       VALUE            23.05.16
000472                        'ERROR CERRANDO DE FICHERO FPCRECL1'.     23.05.16
000473     05  LIT-ERROR-LECTURA1      PIC X(33)       VALUE            23.05.16
000474                              'ERROR LEYENDO DE FICHERO FPCRECE1'.23.05.16
000475     05  LIT-ERROR-ESCRITURA1    PIC X(37)       VALUE            23.05.16
000476                          'ERROR ESCRIBIENDO DE FICHERO FPCRECS1'.23.05.16
000477     05  LIT-ERROR-ESCRITURA3    PIC X(37)       VALUE            23.05.16
000478                          'ERROR ESCRIBIENDO DE FICHERO FPCRECL1'.23.05.16
000479     05  LIT-NO-REG-CAX          PIC X(40)       VALUE            23.05.16
000480                       'NO EXISTE REGISTRO EN FICHERO DE POLIZAS'.23.05.16
000481     05  LIT-CONSULTA-CPX        PIC X(33)       VALUE            23.05.16
000482                              'ERROR AL CONSULTAR EL COASEGURO'.  23.05.16
000483     05  LIT-CONSULTA-CDX        PIC X(33)       VALUE            23.05.16
000484                              'ERROR AL CONSULTAR LA GARANTIA'.   23.05.16
000485     05  LIT-CONSULTA-TEX        PIC X(38)       VALUE            23.05.16
000486                         'ERROR AL CONSULTAR EL CODIGO DE TABLA'. 23.05.16
000487     05  LIT-CONSULTA-ACX        PIC X(38)       VALUE            23.05.16
000488                         'ERROR AL CONSULTAR TABLA ACX'.          23.05.16
000489     05  LIT-CONSULTA-CKX        PIC X(33)       VALUE            23.05.16
000490                              'ERROR AL CONSULTAR EL TOMADOR'.    23.05.16
000491     05  LIT-CONSULTA-FAX       PIC X(33)       VALUE             23.05.16
000492                              'ERROR AL CONSULTAR EL RECIBO'.     23.05.25
000493     05  LIT-CONSULTA-ZFX       PIC X(33)       VALUE             23.05.25
000494                              'ERROR AL CONSULTAR EL SUPLEMENTO'. 23.05.25
000493     05  LIT-CONSULTA-CAX       PIC X(33)       VALUE             23.05.16
000494                              'ERROR AL CONSULTAR CABCOASE'.      23.05.19
000495     05  LIT-TIPO-MOVIMIENTO    PIC X(33)       VALUE             23.05.19
000496                              'TIPO DE MOVIMIENTO NO CONTEMPLADO'.23.05.19
000495     05  LIT-TABLA-DESBORDADA    PIC X(33)       VALUE            23.05.16
000496                              'ERROR TABLA DESBORDADA'.           23.05.16
000497     05  LIT-ERROR-DSPCMCTR      PIC X(45) VALUE                  23.05.16
000498                             'ERROR EN LLAMADA A RUTINA DSPCMCTR'.23.05.16
000499     05  LIT-ERROR-KRBLMC51      PIC X(45) VALUE                  23.05.16
000500                             'ERROR EN LLAMADA A RUTINA KRBLMC51'.23.05.16
000501     05  LIT-ERROR-NUOCURRE      PIC X(45) VALUE                  23.05.16
000502                            'ERROR NUOCURRE 0 EN RUTINA KRBLMC51'.23.05.16
000503     05  LIT-5100                PIC X(18)       VALUE            23.05.16
000504                                   '5100-LEER-ENTRADA1'.          23.05.16
000505     05  LIT-6100                PIC X(19)       VALUE            23.05.16
000506                                   '6100-GRABAR-SALIDA1'.         23.05.16
000507     05  LIT-6200                PIC X(19)       VALUE            23.05.16
000508                                   '6200-GRABAR-SALIDA1'.         23.05.16
000509     05  LIT-PARRAFO-1300        PIC X(30) VALUE                  23.05.16
000510                                   '1300-OBTENER-FECHA-DSPC'.     23.05.16
000511     05  LIT-PARRAFO-9100        PIC X(30) VALUE                  23.05.16
000512                                   '9100-CHECK-FS-ENTRADA1'.      23.05.16
000513     05  LIT-PARRAFO-9300        PIC X(30) VALUE                  23.05.16
000514                                   '9300-CHECK-FS-SALIDA1'.       23.05.16
000515     05  LIT-PARRAFO-9400        PIC X(30) VALUE                  23.05.16
000516                                   '9400-CHECK-FS-SALIDA2'.       23.05.16
000517     05  LIT-PARRAFO-2210        PIC X(30) VALUE                  23.05.16
000518                                   '2210-ABRIR-CURSOR-COASEG'.    23.05.25
000519     05  LIT-PARRAFO-2653        PIC X(30) VALUE                  23.05.25
000520                                   '2653-ABRIR-CURSOR-ZFX'.       23.05.25
000519     05  LIT-PARRAFO-2220        PIC X(30) VALUE                  23.05.16
000520                                   '2220-FETCH-CURSOR-COASEG'.    23.05.25
000521     05  LIT-PARRAFO-2655        PIC X(30) VALUE                  23.05.25
000522                                   '2655-FETCH-CURSOR-ZFX'.       23.05.25
000521     05  LIT-PARRAFO-2250        PIC X(30) VALUE                  23.05.16
000522                                   '2250-CERRAR-CURSOR-COASEG'.   23.05.25
000523     05  LIT-PARRAFO-2657        PIC X(30) VALUE                  23.05.25
000524                                   '2657-CERRAR-CURSOR-ZFX'.      23.05.25
000523     05  LIT-PARRAFO-2621        PIC X(30) VALUE                  23.05.16
000524                                   '2621-ABRIR-CURSOR-COASEG'.    23.05.16
000525     05  LIT-PARRAFO-2625        PIC X(30) VALUE                  23.05.16
000526                                   '2625-PROCESO-CURSOR'.         23.05.16
000527     05  LIT-PARRAFO-2626        PIC X(30) VALUE                  23.05.16
000528                                   '2626-FETCH-CURSOR-COASEG'.    23.05.16
000529     05  LIT-PARRAFO-2627        PIC X(30) VALUE                  23.05.16
000530                                   '2627-CERRAR-CURSOR-COASEG'.   23.05.16
000531     05  LIT-PARRAFO-2660        PIC X(30) VALUE                  23.05.16
000532                                   '2660-LLAMADA-KRBLMC51'.       23.05.16
000533     05  LIT-ERROR-ABRIR-E1      PIC X(40) VALUE                  23.05.16
000534          'NO SE PUEDE ABRIR FPCRECE1'.                           23.05.16
000535*                                                                 23.05.16
000536     05  LIT-ERROR-ABRIR-S1      PIC X(40) VALUE                  23.05.16
000537          'NO SE PUEDE ABRIR FPCRECS1'.                           23.05.16
000538*                                                                 23.05.16
000539     05  LIT-ERROR-ABRIR-S2      PIC X(40) VALUE                  23.05.16
000540          'NO SE PUEDE ABRIR FPCRECL1'.                           23.05.16
000541     05  LIT-ENT-ABRIDORA        PIC X(05) VALUE '10008'.         23.05.16
000542     05  LIT-ALMOHADILLA         PIC X(01) VALUE '#'.             23.05.16
000543*                                                                 23.05.16
000544                                                                  23.05.16
000545                                                                  23.05.16
000546******************************************************************23.05.16
000547*                AREA DE CONTADORES                              *23.05.16
000548******************************************************************23.05.16
000549                                                                  23.05.16
000550 01  CONT-CONTADORES.                                             23.05.16
000551     05  CONT-LEIDOS1            PIC S9(9) COMP-3                 23.05.16
000552                                                 VALUE ZEROS.     23.05.16
000553     05  CONT-LEIDOS2            PIC S9(9) COMP-3                 23.05.16
000554                                                 VALUE ZEROS.     23.05.16
000555     05  CONT-GRABADOS1          PIC S9(9) COMP-3                 23.05.16
000556                                                 VALUE ZEROS.     23.05.16
000557     05  CONT-ERRORES            PIC S9(9) COMP-3                 23.05.16
000558                                                 VALUE ZEROS.     23.05.16
000559     05  CONT-CURSOR-INTERES     PIC 9(02)       VALUE ZEROS.     23.05.16
000560                                                                  23.05.16
000561******************************************************************23.05.16
000562*                AREA DE VARIABLES                               *23.05.16
000563******************************************************************23.05.16
000564                                                                  23.05.16
000565 01  VAR-VARIABLES.                                               23.05.16
000566     05  VAR-LEIDOS1             PIC S9(9)       VALUE ZEROS.     23.05.16
000567     05  VAR-LEIDOS2             PIC S9(9)       VALUE ZEROS.     23.05.16
000568     05  VAR-GRABADOS1           PIC S9(9)       VALUE ZEROS.     23.05.16
000569     05  VAR-ERRORES             PIC S9(9)       VALUE ZEROS.     23.05.16
000570     05  CO-SQLCODE              PIC  S9(9) COMP-4.               23.05.16
000571     05  VAR-LEIDOS1-ED          PIC ZZZ.ZZZ.ZZ9.                 23.05.16
000572     05  VAR-LEIDOS2-ED          PIC ZZZ.ZZZ.ZZ9.                 23.05.16
000573     05  VAR-GRABADOS1-ED        PIC ZZZ.ZZZ.ZZ9.                 23.05.16
000574     05  VAR-GRABADOS2-ED        PIC ZZZ.ZZZ.ZZ9.                 23.05.16
000575     05  VAR-ERRORES-ED          PIC ZZZ.ZZZ.ZZ9.                 23.05.16
000576     05  VAR-FEC-FECHA.                                           23.05.16
000577         10 VAR-FEC-ANHO         PIC X(4).                        23.05.16
000578         10 FILLER               PIC X(1)   VALUE '-'.            23.05.16
000579         10 VAR-FEC-MES          PIC X(2).                        23.05.16
000580         10 FILLER               PIC X(1)   VALUE '-'.            23.05.16
000581         10 VAR-FEC-DIA          PIC X(2).                        23.05.16
000582     05  VAR-FEC-FECHA2.                                          23.05.16
000583         10 VAR-FEC-ANHO2        PIC X(4).                        23.05.16
000584         10 VAR-FEC-MES2         PIC X(2).                        23.05.16
000585         10 VAR-FEC-DIA2         PIC X(2).                        23.05.16
000586     05  VAR-FEC-FECHA-AIS REDEFINES VAR-FEC-FECHA2               23.05.16
000587                                 PIC 9(8).                        23.05.16
000588     05  VAR-POLIZAIS.                                            23.05.16
000589         10 VAR-BANCO-AIS        PIC 9(4).                        23.05.16
000590         10 VAR-CEROS            PIC 9(2).                        23.05.16
000591         10 VAR-COD-POLIZA-AIS   PIC 9(8).                        23.05.16
000592     05  VAR-POLIZAIS-NUM REDEFINES VAR-POLIZAIS                  23.05.16
000593                                 PIC X(14).                       23.05.16
000594                                                                  23.05.16
000595     05  VAR-AIS-RECIBO.                                          23.05.16
000596         10 VAR-COD-BANCO-AIS    PIC X(4).                        23.05.16
000597         10 VAR-FEC-COBRO-AIS.                                    23.05.16
000598            15 VAR-FEC-ANHO-AIS  PIC X(4).                        23.05.16
000599            15 VAR-FEC-MES-AIS   PIC X(2).                        23.05.16
000600            15 VAR-FEC-DIA-AIS   PIC X(2).                        23.05.16
000601         10 FILLER               PIC X     VALUE '0'.             23.05.16
000602         10 VAR-COD-RECIBO-AIS   PIC X(4).                        23.05.16
000603     05  WS-BANCO                PIC ZZZ9.                        23.05.16
000604     05  WS-POLIZA               PIC ZZZZZZZ9.                    23.05.16
000605     05  WS-FECHA-ALF            PIC X(10).                       23.05.16
000606     05  WS-BANCO-POLIZA-NUM.                                     23.05.16
000607         10  WS-BANCO-NUM        PIC 9(04).                       23.05.16
000608         10  WS-CEROS-NUM        PIC 9(02).                       23.05.16
000609         10  WS-POLIZA-NUM       PIC 9(04).                       23.05.16
000610     05  WS-BANCO-POLIZA-ALF                                      23.05.16
000611         REDEFINES   WS-BANCO-POLIZA-NUM.                         23.05.16
000612         10  WS-BANCO-POLIZA     PIC X(10).                       23.05.16
000613     05  WS-IND-TOT              PIC 9(4) COMP.                   23.05.16
000614     05  VAR-IND                 PIC 9(4) COMP.                   23.05.16
000615     05  ARR-COASEGURADORAS.                                      23.05.16
000616         10 ARR-COASEG OCCURS 5 TIMES.                            23.05.16
000617            15 ARR-COASEGURADORA PIC X(05).                       23.05.16
000618            15 ARR-ALMOHADILLA   PIC X(01).                       23.05.16
000619     05   ARR-PORCENTAJES.                                        23.05.16
000620          10 ARR-PORCENTAJE OCCURS 5 TIMES.                       23.05.16
000621             15 ARR-POR-PARTIC   PIC 999,99.                      23.05.16
000622             15 ARR-ALMOHADILLA1 PIC X(01).                       23.05.16
000623     05  WS-PORCENTAJE-ALF       PIC X(35).                       23.05.16
000624     05  WS-AUX-PRODUCTO         PIC 9(4).                        23.05.16
000625     05  WS-PRODUCTO             PIC X(4).                        23.05.16
000626          88 WS-PRODUCTO-IND   VALUE   '726','727', '728','729',  23.05.16
000627                                       '781','782','783','6794',  23.05.16
000628                                       '7071', '7072', '9889',    23.05.16
000629*L-0004-INI                                                       23.05.16
000630                                       '7091', '7092'.            23.05.16
000631*L-0004-FIN                                                       23.05.16
000632          88 WS-PRODUCTO-COL   VALUE  '5849','6241','6242','6243',23.05.16
000633                                       '6245', '7578', '9554'.    23.05.16
000634     05  WS-DGS1-T2-TIPINTERES   PIC -999,999999.                 23.05.16
000635     05  WS-DGS1-T3-TIPINTERES   PIC -999,999999.                 23.05.16
000636     05  WS-IMPPROVI-1-GGITEC    PIC 999999999999,99.             23.05.16
000637     05  WS-IMPPROVI-1-GGIDGS    PIC 999999999999,99.             23.05.16
000638     05  WS-IMPPROVI-1-TEC       PIC 999999999999,99.             23.05.16
000639     05  WS-IMPPROVI-1-DGS       PIC 999999999999,99.             23.05.16
000640     05  WS-POR-PARTIC-ACEPTANTE PIC S9(3)V9(6) COMP-3.           23.05.19
000641     05  WS-POR-PARTIC-ABRIDORA  PIC S9(3)V9(6) COMP-3.           23.05.19
000642     05  WS-POR-GAST-COASEG      PIC S9(3)V9(6) COMP-3.           23.05.19
000643     05  WS-PRIMA-TOTAL-TOT      PIC S9(12)V9(2) COMP-3.          23.05.19
000643     05  WS-PRIMA-NETA-TOT       PIC S9(12)V9(2) COMP-3.          23.05.16
000644     05  WS-LIQUIDO-TOT          PIC S9(12)V9(2) COMP-3.          23.05.16
000645     05  WS-GASTOS-ADMIN-TOT     PIC S9(12)V9(2) COMP-3.          23.05.16
000646     05  WS-CCS-IMPORTE-TOT      PIC S9(12)V9(2) COMP-3.          23.05.16
000647     05  WS-CLEA-IMPORTE-TOT     PIC S9(12)V9(2) COMP-3.          23.05.16
000648     05  WS-IPS-IMPORTE-TOT      PIC S9(12)V9(2) COMP-3.          23.05.16
000649     05  WS-CPN-IMPORTE-TOT      PIC S9(12)V9(2) COMP-3.          23.05.16
000650     05  WS-PRIMATAR             PIC S9(12)V9(2) COMP-3.          23.05.16
000651                                                                  23.05.16
000652     05  WS-PRIMA-TOTAL-ACX      PIC S9(12)V9(2) COMP-3.          23.05.26
000653     05  WS-PRIMA-NETA-ACX       PIC S9(12)V9(2) COMP-3.          23.05.28
000654     05  WS-PRIMA-NETA-MANU      PIC S9(12)V9(2) COMP-3.          23.05.28
000654     05  WS-PRIMAPUR-ACX         PIC S9(12)V9(2) COMP-3.          23.05.26
000654     05  WS-CCS-IMPORTE-ACX      PIC S9(12)V9(2) COMP-3.          23.05.26
000655     05  WS-CLEA-IMPORTE-ACX     PIC S9(12)V9(2) COMP-3.          23.05.26
000656     05  WS-IPS-IMPORTE-ACX      PIC S9(12)V9(2) COMP-3.          23.05.26
000657     05  WS-CPN-IMPORTE-ACX      PIC S9(12)V9(2) COMP-3.          23.05.26
000658                                                                  23.05.16
000659                                                                  23.05.16
000660     05  WS-GASINT               PIC S9(12)V9(2) COMP-3.          23.05.16
000661     05  WS-GASINT-TOT           PIC S9(12)V9(2) COMP-3.          23.05.16
000662     05  WS-GASINT-COA           PIC S9(12)V9(2) COMP-3.          23.05.16
000663     05  WS-GASINT-1             PIC S9(12)V9(2) COMP-3.          23.05.16
000664     05  WS-GASINT-2             PIC S9(12)V9(2) COMP-3.          23.05.16
000665     05  WS-POR-DISTGINT         PIC S9(12)V9(2) COMP-3.          23.05.16
000666                                                                  23.05.16
000667                                                                  23.05.16
000668                                                                  23.05.16
000669     05  WS-PRIMA-TOTAL          PIC S9(12)V9(2) COMP-3.          23.05.16
000670     05  WS-PRIMA-TOTAL-C        PIC S9(12)V9(2) COMP-3.          23.05.16
000671     05  WS-PRIMA-NETA           PIC S9(12)V9(2) COMP-3.          23.05.16
000672     05  WS-LIQUIDO              PIC S9(12)V9(2) COMP-3.          23.05.16
000673     05  WS-GASTOS-ADMIN         PIC S9(12)V9(2) COMP-3.          23.05.16
000674     05  WS-CCS-IMPORTE          PIC S9(12)V9(2) COMP-3.          23.05.16
000675     05  WS-CLEA-IMPORTE         PIC S9(12)V9(2) COMP-3.          23.05.16
000676     05  WS-IPS-IMPORTE          PIC S9(12)V9(2) COMP-3.          23.05.16
000677     05  WS-CPN-IMPORTE          PIC S9(12)V9(2) COMP-3.          23.05.16
000678     05  WS-PB                   PIC S9(12)V9(2) COMP-3.          23.05.16
000679*L-0001-INI                                                       23.05.16
000680     05  WS-LINEA-RECIBOS        PIC X(705).                      23.05.16
000681     05  WS-LINEA-RECIBO-CESION  PIC X(705).                      23.05.16
000682*L-0001-FIN                                                       23.05.16
000683*L-0002-INI                                                       23.05.16
000684     05  WS-REGISTRO-CAB         PIC X(07).                       23.05.16
000685     05  WS-FECHA-CAB            PIC X(19).                       23.05.16
000686     05  WS-IDEMISOR-CAB         PIC X(05).                       23.05.16
000687     05  WS-IDPERCEPTOR-CAB      PIC X(05).                       23.05.16
000688     05  WS-IDFICHERO-CAB        PIC X(40).                       23.05.16
000689     05  WS-COD-RESUL-CAB        PIC X(04).                       23.05.16
000690     05  WS-DESC-RESUL-CAB       PIC X(40).                       23.05.16
000691     05  WS-LINEA-CABECERA       PIC X(248).                      23.05.16
000692*L-0002-FIN                                                       23.05.16
000693                                                                  23.05.16
000694******************************************************************23.05.16
000695*           P R O C E D U R E      D I V I S I O N               *23.05.16
000696******************************************************************23.05.16
000697                                                                  23.05.16
000698 PROCEDURE DIVISION.                                              23.05.16
000699                                                                  23.05.16
000700     PERFORM 1000-INICIO                                          23.05.16
000701                                                                  23.05.16
000702     PERFORM 2000-PROCESO UNTIL   FIN-ENTRADA1                    23.05.16
000703                                                                  23.05.16
000704     PERFORM 3000-FINAL.                                          23.05.16
000705                                                                  23.05.16
000706                                                                  23.05.16
000707******************************************************************23.05.16
000708* 1000-INICIO                                                    *23.05.16
000709* SE ABREN LOS FICHEROS DE ENTRADA Y SALIDA.                     *23.05.16
000710* SE CONTROLA EL FILE STATUS.                                    *23.05.16
000711* SE REALIZA LA PRIMERA LECTURA DE LOS FICHEROS DE ENTRADA.      *23.05.16
000712******************************************************************23.05.16
000713                                                                  23.05.16
000714 1000-INICIO.                                                     23.05.16
000715                                                                  23.05.16
000716     PERFORM 1100-INI-VARIABLES                                   23.05.16
000717                                                                  23.05.16
000718     PERFORM 1200-ABRIR-FICHEROS                                  23.05.16
000719                                                                  23.05.16
000720     PERFORM 1300-OBTENER-FECHA-DSPC                              23.05.16
000721                                                                  23.05.16
000722*L-0002-INI                                                       23.05.16
000723     PERFORM 1310-INFORMAR-CABECERA                               23.05.16
000724                                                                  23.05.16
000725     PERFORM 6200-GRABAR-CABECERA                                 23.05.16
000726*L-0002-FIN                                                       23.05.16
000727                                                                  23.05.16
000728     PERFORM 5100-LEER-ENTRADA1                                   23.05.16
000729                                                                  23.05.16
000730     .                                                            23.05.16
000731                                                                  23.05.16
000732******************************************************************23.05.16
000733* 1100-INI-VARIABLES                                             *23.05.16
000734* SE INICIALIZAN CONTADORES Y VARIABLES DE TRABAJO.              *23.05.16
000735******************************************************************23.05.16
000736 1100-INI-VARIABLES.                                              23.05.16
000737                                                                  23.05.16
000738     INITIALIZE CRT2-CDSPCRT2                                     23.05.16
000739                VAR-VARIABLES                                     23.05.16
000740                SW-SWITCHES                                       23.05.16
000741                ARR-COASEGURADORAS                                23.05.16
000742     INITIALIZE WS-PORCENTAJE-ALF                                 23.05.16
000743     MOVE WS-PORCENTAJE-ALF      TO ARR-PORCENTAJES               23.05.16
000744                                                                  23.05.16
000745     MOVE LIT-NO-ERROR           TO CRT2-COD-ERROR                23.05.16
000746                                                                  23.05.16
000747     SET NO-FIN-ENTRADA1         TO TRUE                          23.05.16
000748     SET NO-ERROR-GRAVE          TO TRUE                          23.05.16
000749     .                                                            23.05.16
000750                                                                  23.05.16
000751*----------------------------------------------------------------*23.05.16
000752* 1200-ABRIR-FICHEROS                                            *23.05.16
000753* SE ABREN LOS FICHEROS DE ENTRADA Y SALIDA.                     *23.05.16
000754* SE CONTROLA EL FILE STATUS.                                    *23.05.16
000755*----------------------------------------------------------------*23.05.16
000756 1200-ABRIR-FICHEROS.                                             23.05.16
000757                                                                  23.05.16
000758     OPEN INPUT  FPCRECE1                                         23.05.16
000759          OUTPUT FPCRECS1                                         23.05.16
000760                 FPCRECL1                                         23.05.16
000761                                                                  23.05.16
000762     MOVE LIT-1200                TO CRT2-COD-PARR-ERR            23.05.16
000763     MOVE LIT-ERROR-APERTURA1     TO CRT2-DES-ERROR               23.05.16
000764                                                                  23.05.16
000765     MOVE LIT-OPEN                TO COD-ACCESO-ERR-QPIPCCAB      23.05.16
000766     STRING LIT-ERROR-ABRIR-E1 LIT-FS FS-FPCRECE1                 23.05.16
000767     DELIMITED BY SIZE                                            23.05.16
000768     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
000769                                                                  23.05.16
000770     PERFORM 9100-CHECK-FS-ENTRADA1                               23.05.16
000771                                                                  23.05.16
000772     MOVE LIT-ERROR-APERTURA3  TO CRT2-DES-ERROR                  23.05.16
000773     STRING LIT-ERROR-ABRIR-S1 LIT-FS FS-FPCRECS1                 23.05.16
000774     DELIMITED BY SIZE                                            23.05.16
000775     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
000776                                                                  23.05.16
000777     PERFORM 9300-CHECK-FS-SALIDA1                                23.05.16
000778                                                                  23.05.16
000779     MOVE LIT-ERROR-APERTURA4  TO CRT2-DES-ERROR                  23.05.16
000780     STRING LIT-ERROR-ABRIR-S2 LIT-FS FS-FPCRECL1                 23.05.16
000781     DELIMITED BY SIZE                                            23.05.16
000782     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
000783                                                                  23.05.16
000784     PERFORM 9400-CHECK-FS-SALIDA2                                23.05.16
000785                                                                  23.05.16
000786     .                                                            23.05.16
000787                                                                  23.05.16
000788******************************************************************23.05.16
000789* 1300-OBTENER-FECHA-DSPC.                                       *23.05.16
000790*----------------------------------------------------------------*23.05.16
000791* SE REALIZA LA LLAMADA A LA RUTINA DSPCMCTR PARA OBTENER LA     *23.05.16
000792* FECHA.                                                         *23.05.16
000793******************************************************************23.05.16
000794 1300-OBTENER-FECHA-DSPC.                                         23.05.16
000795                                                                  23.05.16
000796     MOVE CTE-CONSULTA TO CCTR-XTI-CONSULTA                       23.05.16
000797     MOVE CTE-SYSTEM   TO CCTR-DES-USUARIO                        23.05.16
000798     MOVE CTE-BATCH    TO CCTR-DES-TRANSACCION                    23.05.16
000799                                                                  23.05.16
000800     CALL CTE-DSPCMCTR  USING CCTR-CDSPCCTR                       23.05.16
000801                                                                  23.05.16
000802     IF CCTR-COD-ERROR NOT EQUAL ZERO                             23.05.16
000803        INITIALIZE CRT2-CDSPCRT2                                  23.05.16
000804                                                                  23.05.16
000805        MOVE LIT-PARRAFO-1300       TO CRT2-COD-PARR-ERR          23.05.16
000806        MOVE LIT-ERROR-DSPCMCTR     TO CRT2-DES-ERROR             23.05.16
000807        MOVE CCTR-COD-ERROR         TO CRT2-COD-ERROR             23.05.16
000808        MOVE LIT-E                  TO CRT2-COD-TIPO-ERROR        23.05.16
000809        MOVE LIT-PROGRAMA           TO CRT2-COD-PROG-ERR          23.05.16
000810                                                                  23.05.16
000811        PERFORM 6300-GRABAR-ERROR                                 23.05.16
000812                                                                  23.05.16
000813        MOVE LIT-E                   TO XTI-AVIERROR-QPIPCCAB     23.05.16
000814        MOVE LIT-PROGRAMA            TO COD-MODULO-ERR-QPIPCCAB   23.05.16
000815        MOVE LIT-PARRAFO-1300        TO COD-PARRAFO-ERR-QPIPCCAB  23.05.16
000816        MOVE LIT-ERROR-DSPCMCTR      TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
000817        MOVE ZEROS                   TO QNU-SQLCODE-ERR-QPIPCCAB  23.05.16
000818        MOVE LIT-ERROR-DSPCMCTR      TO DES-SQLCA-ERR-QPIPCCAB    23.05.16
000819                                                                  23.05.16
000820        PERFORM 9999-ERROR-GENERAL                                23.05.16
000821                                                                  23.05.16
000822     END-IF.                                                      23.05.16
000823*L-0002-INI                                                       23.05.16
000824******************************************************************23.05.16
000825* 1310-INFORMAR-CABECERA.                                       * 23.05.16
000826*----------------------------------------------------------------*23.05.16
000827* SE INFORMA LA CABECERA QUE SERA EL PRIMER REGISTRO DEL FICHERO *23.05.16
000828* DE SALIDA                                                      *23.05.16
000829******************************************************************23.05.16
000830 1310-INFORMAR-CABECERA.                                          23.05.16
000831                                                                  23.05.16
000832     MOVE LIT-FICHERO             TO WS-REGISTRO-CAB              23.05.16
000833                                                                  23.05.16
000834     MOVE CCTR-TIMESTAMP(1:19)    TO WS-FECHA-CAB                 23.06.05
000836                                                                  23.06.05
000838     MOVE CTE-T                   TO WS-FECHA-CAB(11:1)           23.05.16
000839     MOVE CTE-PUNTOS              TO WS-FECHA-CAB(14:1)           23.05.16
000840     MOVE CTE-PUNTOS              TO WS-FECHA-CAB(17:1)           23.05.16
000841     MOVE LIT-C0502               TO WS-IDEMISOR-CAB              23.05.16
000842     MOVE LIT-T0000               TO WS-IDPERCEPTOR-CAB           23.05.16
000843     .                                                            23.06.05
000851*L-0002-FIN                                                       23.05.16
000852*                                                                 23.05.16
000853*                                                                 23.05.16
000854******************************************************************23.05.16
000855* 5100-LEER-ENTRADA1.                                            *23.05.16
000856* SE LEE EL FICHERO DE ENTRADA1, CONTROLAMOS SU FINAL Y SU FILE  *23.05.16
000857* STATUS                                                         *23.05.16
000858******************************************************************23.05.16
000859                                                                  23.05.16
000860 5100-LEER-ENTRADA1.                                              23.05.16
000861                                                                  23.05.16
000862     INITIALIZE CDSPCTRE                                          23.05.16
000863                                                                  23.05.16
000864     READ FPCRECE1 INTO CDSPCTR1                                  23.05.16
000865         AT END SET FIN-ENTRADA1     TO TRUE                      23.05.16
000866     END-READ                                                     23.05.16
000867                                                                  23.05.16
000868     IF NO-FIN-ENTRADA1                                           23.05.16
000869                                                                  23.05.16
000870        MOVE LIT-5100                  TO CRT2-COD-PARR-ERR       23.05.16
000871        MOVE LIT-ERROR-LECTURA1        TO CRT2-DES-ERROR          23.05.16
000872                                                                  23.05.16
000873        MOVE LIT-READ                  TO COD-ACCESO-ERR-QPIPCCAB 23.05.16
000874        STRING LIT-ERROR-LECTURA1 LIT-FS FS-FPCRECE1              23.05.16
000875        DELIMITED BY SIZE                                         23.05.16
000876        INTO DES-SQLCA-ERR-QPIPCCAB                               23.05.16
000877                                                                  23.05.16
000878        PERFORM 9100-CHECK-FS-ENTRADA1                            23.05.16
000879                                                                  23.05.16
000880*        DISPLAY 'CTR1-COD-PLATAFORMA: ' CTR1-COD-PLATAFORMA      23.05.16
000881*        DISPLAY 'CTR1-PROD-COMERCIAL: ' CTR1-PROD-COMERCIAL      23.05.16
000882*        DISPLAY 'CTR1-COD-POLIZAIS: ' CTR1-COD-POLIZAIS          23.05.16
000883*        DISPLAY 'CTR1-COD-POLIZPLAT: ' CTR1-COD-POLIZPLAT        23.05.16
000884*        DISPLAY 'CTR1-NUM-RECIBO: ' CTR1-NUM-RECIBO              23.05.16
000885*        DISPLAY 'CTR1-NUM-RECIBO-PLAT: ' CTR1-NUM-RECIBO-PLAT    23.05.16
000886*        DISPLAY 'CTR1-TIPO-MOVIMIENTO: ' CTR1-TIPO-MOVIMIENTO    23.05.16
000887*        DISPLAY 'CTR1-FEC-MOVIMIENTO: ' CTR1-FEC-MOVIMIENTO      23.05.16
000888*        DISPLAY 'CTR1-CANAL-COBRO: ' CTR1-CANAL-COBRO            23.05.16
000889*        DISPLAY 'CTR1-NUM-CUENTA: ' CTR1-NUM-CUENTA              23.05.16
000890*        DISPLAY 'CTR1-FEC-EMISION: ' CTR1-FEC-EMISION            23.05.16
000891*        DISPLAY 'CTR1-FEC-EFECTO: ' CTR1-FEC-EFECTO              23.05.16
000892*        DISPLAY 'CTR1-FEC-VENCIMIENTO: ' CTR1-FEC-VENCIMIENTO    23.05.16
000893*        DISPLAY 'CTR1-PRIMA-NETA: ' CTR1-PRIMA-NETA              23.05.16
000894*        DISPLAY 'CTR1-CONSORCIO: ' CTR1-CONSORCIO                23.05.16
000895*        DISPLAY 'CTR1-LEA: ' CTR1-LEA                            23.05.16
000896*        DISPLAY 'CTR1-IPS: ' CTR1-IPS                            23.05.16
000897*        DISPLAY 'CTR1-COMISION: ' CTR1-COMISION                  23.05.16
000898                                                                  23.05.16
000899                                                                  23.05.16
000900        MOVE CTR1-COD-POLIZAIS                                    23.05.16
000901          TO CTRE-COD-POLIZA                                      23.05.16
000902                                                                  23.05.16
000903        MOVE LIT-RECIBO                                           23.05.16
000904          TO CTRE-TIPO-REGISTRO                                   23.05.16
000905                                                                  23.05.16
000906        EVALUATE CTR1-TIPO-MOVIMIENTO                             23.05.16
000907           WHEN CTE-01                                            23.05.16
000908           WHEN CTE-02                                            23.05.16
000909                MOVE LIT-2-1      TO CTRE-TIPO-MOVIMIENTO         23.05.19
000910           WHEN CTE-04                                            23.05.19
000910           WHEN CTE-24                                            23.05.19
000911                MOVE LIT-2-2      TO CTRE-TIPO-MOVIMIENTO         23.05.19
000912           WHEN CTE-30                                            23.05.19
000913                MOVE LIT-2-3      TO CTRE-TIPO-MOVIMIENTO         23.05.19
000914           WHEN CTE-08                                            23.05.19
000914           WHEN CTE-025                                           23.05.19
000915                MOVE LIT-2-4      TO CTRE-TIPO-MOVIMIENTO         23.05.19
000916           WHEN OTHER                                             23.05.19
000917                MOVE LIT-5100     TO CRT2-COD-PARR-ERR            23.05.19
000918                MOVE LIT-TIPO-MOVIMIENTO                          23.05.19
000918                  TO CRT2-DES-ERROR                               23.05.19
000920                MOVE LIT-E        TO CRT2-COD-TIPO-ERROR          23.05.19
000921                MOVE LIT-PROGRAMA TO CRT2-COD-PROG-ERR            23.05.19
000922                                                                  23.05.19
000923                MOVE CTR1-COD-POLIZAIS(1:4)                       23.05.19
000923                  TO CRT2-COD-BANCO                               23.05.19
000924                MOVE CTR1-COD-POLIZAIS(7:8)                       23.05.19
000924                  TO CRT2-COD-POLIZPSC                            23.05.19
000925                                                                  23.05.19
000926                PERFORM 6300-GRABAR-ERROR                         23.05.19
000927                                                                  23.05.19
000928                MOVE LIT-E        TO XTI-AVIERROR-QPIPCCAB        23.05.19
000929                MOVE LIT-PROGRAMA TO COD-MODULO-ERR-QPIPCCAB      23.05.19
000931                MOVE LIT-5100     TO COD-PARRAFO-ERR-QPIPCCAB     23.05.19
000934                                                                  23.05.19
000911                PERFORM 9999-ERROR-GENERAL                        23.05.16
000912        END-EVALUATE                                              23.05.16
000913                                                                  23.05.16
000914        MOVE CCTR-FEC-DIARIO           TO WS-FECHA-ALF            23.05.16
000915        MOVE WS-FECHA-ALF                                         23.05.16
000916          TO CTRE-FECHA                                           23.05.16
000917                                                                  23.05.16
000918        MOVE CTR1-PROD-COMERCIAL       TO WS-PRODUCTO             23.05.16
000919                                                                  23.05.16
000920        IF WS-PRODUCTO-COL                                        23.05.16
000921           MOVE LIT-121                TO CTRE-RAMO               23.05.16
000922        END-IF                                                    23.05.16
000923                                                                  23.05.16
000924        IF WS-PRODUCTO-IND                                        23.05.16
000925           MOVE LIT-111                TO CTRE-RAMO               23.05.16
000926        END-IF                                                    23.05.16
000927                                                                  23.05.16
000928        MOVE CTR1-NUM-RECIBO           TO CTRE-NUMERO-RECIBO      23.05.16
000929                                                                  23.05.16
000930        IF CTR1-CANAL-COBRO = LIT-BC                              23.05.16
000931           MOVE LIT-RECIBO        TO CTRE-SOPORTE-RECIBO          23.05.16
000932        ELSE                                                      23.05.16
000933         IF CTR1-CANAL-COBRO = LIT-CD                             23.05.16
000934            MOVE LIT-TRANSF       TO CTRE-SOPORTE-RECIBO          23.05.16
000935         END-IF                                                   23.05.16
000936        END-IF                                                    23.05.16
000937                                                                  23.05.16
000938        MOVE CTR1-FEC-EFECTO           TO VAR-FEC-FECHA-AIS       23.05.16
000939        MOVE VAR-FEC-ANHO2             TO VAR-FEC-ANHO            23.05.16
000940        MOVE VAR-FEC-MES2              TO VAR-FEC-MES             23.05.16
000941        MOVE VAR-FEC-DIA2              TO VAR-FEC-DIA             23.05.16
000942        MOVE VAR-FEC-FECHA             TO CTRE-FECHA-EFECTO       23.05.16
000943                                                                  23.05.16
000944        MOVE CTR1-FEC-VENCIMIENTO      TO VAR-FEC-FECHA-AIS       23.05.16
000945        MOVE VAR-FEC-ANHO2             TO VAR-FEC-ANHO            23.05.16
000946        MOVE VAR-FEC-MES2              TO VAR-FEC-MES             23.05.16
000947        MOVE VAR-FEC-DIA2              TO VAR-FEC-DIA             23.05.16
000948        MOVE VAR-FEC-FECHA             TO CTRE-FECHA-VENCIMIENTO  23.05.16
000949                                                                  23.05.16
000950        MOVE CTR1-FEC-EMISION          TO VAR-FEC-FECHA-AIS       23.05.16
000951        MOVE VAR-FEC-ANHO2             TO VAR-FEC-ANHO            23.05.16
000952        MOVE VAR-FEC-MES2              TO VAR-FEC-MES             23.05.16
000953        MOVE VAR-FEC-DIA2              TO VAR-FEC-DIA             23.05.16
000954        MOVE VAR-FEC-FECHA             TO CTRE-FECHA-EMISION      23.05.16
000955                                                                  23.05.16
000956                                                                  23.05.16
000957        MOVE LIT-PARCIAL               TO CTRE-TIPOEMISION        23.05.16
000958        MOVE LIT-EUR                   TO CTRE-MONEDA             23.05.16
000959        MOVE CTN-0                     TO CTRE-CCSRE-IMPORTE      23.05.16
000960                                                                  23.05.16
000961        ADD CTE-SUMA-1                 TO CONT-LEIDOS1            23.05.16
000962                                                                  23.05.16
000963     END-IF.                                                      23.05.16
000964                                                                  23.05.16
000965                                                                  23.05.16
000966******************************************************************23.05.16
000967* 2000-PROCESO                                                   *23.05.16
000968******************************************************************23.05.16
000969                                                                  23.05.16
000970 2000-PROCESO.                                                    23.05.16
000971                                                                  23.05.16
000972     SET NO-ERROR-GRAVE                    TO TRUE                23.05.16
000973                                                                  23.05.16
000974     PERFORM 2025-OBTENER-CABCOASE                                23.05.16
000975                                                                  23.05.16
000976     IF NO-ERROR-GRAVE                                            23.05.16
000977        PERFORM 2050-OBTENER-ORDENCOA                             23.05.16
000978     END-IF                                                       23.05.16
000979                                                                  23.05.16
000980     IF NO-ERROR-GRAVE                                            23.05.16
000981        PERFORM 2200-DATOS-COASEGURO                              23.05.16
000982     END-IF                                                       23.05.16
000983                                                                  23.05.16
000984     IF NO-ERROR-GRAVE                                            23.05.16
000985        PERFORM 2300-TIPO-GARANTIA                                23.05.16
000986     END-IF                                                       23.05.16
000987                                                                  23.05.16
000988     IF NO-ERROR-GRAVE                                            23.05.16
000989        PERFORM 2600-OBTENER-IMPORTES                             23.05.16
000990     END-IF                                                       23.05.16
000991                                                                  23.05.16
000992     PERFORM 5100-LEER-ENTRADA1                                   23.05.16
000993                                                                  23.05.16
000994     .                                                            23.05.16
000995******************************************************************23.05.16
000996* 2025-OBTENER-CABCOASE                                        *  23.05.16
000997******************************************************************23.05.16
000998 2025-OBTENER-CABCOASE.                                           23.05.16
000999                                                                  23.05.16
001000     MOVE CTR1-COD-POLIZAIS             TO VAR-POLIZAIS-NUM       23.05.16
001001                                                                  23.05.16
001002                                                                  23.05.16
001003     MOVE VAR-BANCO-AIS                 TO CAX-COD-BANCO          23.05.16
001004     MOVE VAR-COD-POLIZA-AIS            TO CAX-COD-POLIZPSC       23.05.16
001005                                                                  23.05.16
001006                                                                  23.05.16
001007     EXEC SQL                                                     23.05.16
001008         SELECT                                                   23.05.16
001009                COD_CABCOASE                                      23.05.16
001010         INTO                                                     23.05.16
001011                :CAX-COD-CABCOASE                                 23.05.16
001012         FROM TDSPCCAX                                            23.05.16
001013         WHERE                                                    23.05.16
001014               COD_BANCO    = :CAX-COD-BANCO    AND               23.05.16
001015               COD_POLIZPSC = :CAX-COD-POLIZPSC                   23.05.16
001016     END-EXEC                                                     23.05.16
001017                                                                  23.05.16
001018     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001019                                                                  23.05.16
001020     EVALUATE SQLCODE                                             23.05.16
001021       WHEN ZEROS                                                 23.05.16
001022          CONTINUE                                                23.05.16
001023       WHEN CTE-100                                               23.05.16
001024                                                                  23.05.16
001025            MOVE LIT-2025          TO CRT2-COD-PARR-ERR           23.05.16
001026            MOVE LIT-CONSULTA-CAX  TO CRT2-DES-ERROR              23.05.16
001027            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001028            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001029            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001030                                                                  23.05.16
001031            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001032            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001033                                                                  23.05.16
001034            PERFORM 6300-GRABAR-ERROR                             23.05.16
001035                                                                  23.05.16
001036            SET SI-ERROR-GRAVE     TO TRUE                        23.05.16
001037                                                                  23.05.16
001038       WHEN OTHER                                                 23.05.16
001039                                                                  23.05.16
001040            MOVE LIT-2025          TO CRT2-COD-PARR-ERR           23.05.16
001041            MOVE LIT-CONSULTA-CAX  TO CRT2-DES-ERROR              23.05.16
001042            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001043            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001044            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001045                                                                  23.05.16
001046            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001047            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001048                                                                  23.05.16
001049            PERFORM 6300-GRABAR-ERROR                             23.05.16
001050                                                                  23.05.16
001051            MOVE LIT-E              TO XTI-AVIERROR-QPIPCCAB      23.05.16
001052            MOVE LIT-PROGRAMA       TO COD-MODULO-ERR-QPIPCCAB    23.05.16
001053            MOVE LIT-TDSPCCAX       TO COD-TABLA-ERR-QPIPCCAB     23.05.16
001054            MOVE LIT-2025           TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
001055            MOVE LIT-DB2            TO COD-ACCESO-ERR-QPIPCCAB    23.05.16
001056            MOVE SQLCODE            TO QNU-SQLCODE-ERR-QPIPCCAB   23.05.16
001057                                                                  23.05.16
001058            PERFORM 9999-ERROR-GENERAL                            23.05.16
001059                                                                  23.05.16
001060     END-EVALUATE                                                 23.05.16
001061     .                                                            23.05.16
001062                                                                  23.05.16
001063******************************************************************23.05.16
001064* 2050-OBTENER-ORDENCOA                                        *  23.05.16
001065******************************************************************23.05.16
001066 2050-OBTENER-ORDENCOA.                                           23.05.16
001067                                                                  23.05.16
001068     MOVE CAX-COD-BANCO            TO CPX-COD-BANCO               23.05.16
001069     MOVE CAX-COD-CABCOASE         TO CPX-COD-CUADRO              23.05.16
001070                                                                  23.05.16
001071     EXEC SQL                                                     23.05.16
001072         SELECT                                                   23.05.16
001073                COD_ORDENCOA                                      23.05.16
001074         INTO                                                     23.05.16
001075                :CPX-COD-ORDENCOA                                 23.05.16
001076         FROM TDSPCCPX                                            23.05.16
001077         WHERE                                                    23.05.16
001078               COD_BANCO    = :CPX-COD-BANCO    AND               23.05.16
001079               COD_CUADRO   = :CPX-COD-CUADRO   AND               23.05.16
001080               XTI_ESTADOT  = :LIT-VI           AND               23.05.16
001081               FEC_DESDE   <= :WS-FECHA-ALF     AND               23.05.16
001082               FEC_HASTA   >= :WS-FECHA-ALF                       23.05.16
001083     END-EXEC                                                     23.05.16
001084                                                                  23.05.16
001085     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001086                                                                  23.05.16
001087     EVALUATE SQLCODE                                             23.05.16
001088       WHEN ZEROS                                                 23.05.16
001089          CONTINUE                                                23.05.16
001090       WHEN CTE-100                                               23.05.16
001091                                                                  23.05.16
001092            MOVE LIT-2050          TO CRT2-COD-PARR-ERR           23.05.16
001093            MOVE LIT-CONSULTA-CPX  TO CRT2-DES-ERROR              23.05.16
001094            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001095            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001096            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001097                                                                  23.05.16
001098            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001099            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001100                                                                  23.05.16
001101            PERFORM 6300-GRABAR-ERROR                             23.05.16
001102                                                                  23.05.16
001103            SET SI-ERROR-GRAVE     TO TRUE                        23.05.16
001104                                                                  23.05.16
001105       WHEN OTHER                                                 23.05.16
001106                                                                  23.05.16
001107            MOVE LIT-2050          TO CRT2-COD-PARR-ERR           23.05.16
001108            MOVE LIT-CONSULTA-CPX  TO CRT2-DES-ERROR              23.05.16
001109            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001110            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001111            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001112                                                                  23.05.16
001113            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001114            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001115                                                                  23.05.16
001116            PERFORM 6300-GRABAR-ERROR                             23.05.16
001117                                                                  23.05.16
001118            MOVE LIT-E              TO XTI-AVIERROR-QPIPCCAB      23.05.16
001119            MOVE LIT-PROGRAMA       TO COD-MODULO-ERR-QPIPCCAB    23.05.16
001120            MOVE LIT-TDSPCCPX       TO COD-TABLA-ERR-QPIPCCAB     23.05.16
001121            MOVE LIT-2050           TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
001122            MOVE LIT-DB2            TO COD-ACCESO-ERR-QPIPCCAB    23.05.16
001123            MOVE SQLCODE            TO QNU-SQLCODE-ERR-QPIPCCAB   23.05.16
001124                                                                  23.05.16
001125            PERFORM 9999-ERROR-GENERAL                            23.05.16
001126                                                                  23.05.16
001127     END-EVALUATE                                                 23.05.16
001128     .                                                            23.05.16
001129                                                                  23.05.16
001130******************************************************************23.05.16
001131* 2200-DATOS-COASEGURO                                           *23.05.16
001132******************************************************************23.05.16
001133 2200-DATOS-COASEGURO.                                            23.05.16
001134                                                                  23.05.16
001135     PERFORM 2210-ABRIR-CURSOR-COASEG                             23.05.16
001136                                                                  23.05.16
001137     INITIALIZE ARR-COASEGURADORAS                                23.05.16
001138     INITIALIZE WS-PORCENTAJE-ALF                                 23.05.16
001139     MOVE WS-PORCENTAJE-ALF          TO ARR-PORCENTAJES           23.05.16
001140     MOVE 0                          TO VAR-IND                   23.05.16
001141     PERFORM 2215-PROCESO-CURSOR                                  23.05.16
001142       UNTIL FIN-CURSOR-COASEG                                    23.05.16
001143          OR SI-ERROR-GRAVE                                       23.05.16
001144                                                                  23.05.16
001145     IF VAR-IND GREATER 0 AND NO-ERROR-GRAVE                      23.05.16
001146        MOVE VAR-IND             TO WS-IND-TOT                    23.05.16
001147        MOVE SPACE               TO ARR-ALMOHADILLA(VAR-IND)      23.05.16
001148        MOVE SPACE               TO ARR-ALMOHADILLA1(VAR-IND)     23.05.16
001149     END-IF                                                       23.05.16
001150     MOVE ARR-COASEGURADORAS     TO CTRE-ENT-ACEPTANTE            23.05.16
001151     MOVE ARR-PORCENTAJES        TO CTRE-PARTICIP-ACEPTANTE       23.05.16
001152                                                                  23.05.16
001153     PERFORM 2250-CERRAR-CURSOR-COASEG                            23.05.16
001154                                                                  23.05.16
001155     .                                                            23.05.16
001156                                                                  23.05.16
001157***************************************************************   23.05.16
001158 2210-ABRIR-CURSOR-COASEG.                                        23.05.16
001159***************************************************************   23.05.16
001160     SET NO-FIN-CURSOR-COASEG TO TRUE                             23.05.16
001161                                                                  23.05.16
001162     MOVE CAX-COD-BANCO        TO CQX-COD-BANCO                   23.05.16
001163     MOVE CAX-COD-CABCOASE     TO CQX-COD-CUADRO                  23.05.16
001164     MOVE CPX-COD-ORDENCOA     TO CQX-COD-ORDENCOA                23.05.16
001165                                                                  23.05.16
001166     EXEC SQL                                                     23.05.16
001167         OPEN CURSOR-COASEG                                       23.05.16
001168     END-EXEC                                                     23.05.16
001169                                                                  23.05.16
001170     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001171                                                                  23.05.16
001172     IF SQLCODE NOT EQUAL TO ZERO                                 23.05.16
001173                                                                  23.05.16
001174         INITIALIZE CRT2-CDSPCRT2                                 23.05.16
001175*                                                                 23.05.16
001176         MOVE LIT-E                  TO CRT2-COD-TIPO-ERROR       23.05.16
001177         MOVE LIT-PROGRAMA           TO CRT2-COD-PROG-ERR         23.05.16
001178         MOVE LIT-PARRAFO-2210       TO CRT2-COD-PARR-ERR         23.05.16
001179         MOVE LIT-PARRAFO-2210       TO CRT2-DES-ERROR            23.05.16
001180         MOVE LIT-TDSPCCQX           TO CRT2-COD-TABL-ERR         23.05.16
001181         MOVE CO-SQLCODE             TO CRT2-COD-SQLCODE          23.05.16
001182                                                                  23.05.16
001183         MOVE CAX-COD-BANCO         TO CRT2-COD-BANCO             23.05.16
001184         MOVE CAX-COD-POLIZPSC      TO CRT2-COD-POLIZPSC          23.05.16
001185*                                                                 23.05.16
001186         PERFORM 6300-GRABAR-ERROR                                23.05.16
001187                                                                  23.05.16
001188         MOVE CTE-E                  TO XTI-AVIERROR-QPIPCCAB     23.05.16
001189         MOVE LIT-PROGRAMA           TO COD-MODULO-ERR-QPIPCCAB   23.05.16
001190         MOVE LIT-TDSPCCQX           TO COD-TABLA-ERR-QPIPCCAB    23.05.16
001191         MOVE LIT-PARRAFO-2210       TO COD-PARRAFO-ERR-QPIPCCAB  23.05.16
001192         MOVE LIT-DB2                TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
001193         MOVE SQLCODE                TO QNU-SQLCODE-ERR-QPIPCCAB  23.05.16
001194                                                                  23.05.16
001195         PERFORM 9999-ERROR-GENERAL                               23.05.16
001196     END-IF                                                       23.05.16
001197     .                                                            23.05.16
001198*                                                                 23.05.16
001199***************************************************************   23.05.16
001200 2215-PROCESO-CURSOR.                                             23.05.16
001201***************************************************************   23.05.16
001202     PERFORM 2220-FETCH-CURSOR-COASEG                             23.05.16
001203                                                                  23.05.16
001204     IF NO-FIN-CURSOR-COASEG                                      23.05.16
001205                                                                  23.05.16
001206        IF CQX-COD-COASEG = LIT-COASEG-BBVA                       23.05.16
001207           MOVE LIT-C0502               TO CTRE-ENT-ABRIDORA      23.05.16
001208           COMPUTE CTRE-PARTICIP-ABRIDORA ROUNDED = CQX-POR-PARTIC23.05.16
001209           MOVE CQX-POR-PARTIC          TO WS-POR-PARTIC-ABRIDORA 23.05.16
001210           MOVE SPACES                  TO CTRE-POLIZA-ACEPTANTE  23.05.16
001211           MOVE CQX-POR-DISTGINT        TO WS-POR-DISTGINT        23.05.16
001212                                                                  23.05.16
001213*           DISPLAY 'CTRE-ENT-ABRIDORA: ' CTRE-ENT-ABRIDORA       23.05.16
001214*           DISPLAY 'CQX-POR-PARTIC: ' CQX-POR-PARTIC             23.05.16
001215*           DISPLAY 'WS-POR-DISTGINT: ' WS-POR-DISTGINT           23.05.16
001216                                                                  23.05.16
001217        ELSE                                                      23.05.16
001218           ADD 1                          TO VAR-IND              23.05.16
001219           IF VAR-IND = 6                                         23.05.16
001220               MOVE LIT-2215              TO CRT2-COD-PARR-ERR    23.05.16
001221               MOVE LIT-TABLA-DESBORDADA  TO CRT2-DES-ERROR       23.05.16
001222                                                                  23.05.16
001223               MOVE LIT-E               TO CRT2-COD-TIPO-ERROR    23.05.16
001224               MOVE LIT-PROGRAMA        TO CRT2-COD-PROG-ERR      23.05.16
001225                                                                  23.05.16
001226               MOVE CAX-COD-BANCO      TO CRT2-COD-BANCO          23.05.16
001227               MOVE CAX-COD-POLIZPSC   TO CRT2-COD-POLIZPSC       23.05.16
001228                                                                  23.05.16
001229               PERFORM 6300-GRABAR-ERROR                          23.05.16
001230                                                                  23.05.16
001231               SET SI-ERROR-GRAVE     TO TRUE                     23.05.16
001232           ELSE                                                   23.05.16
001233               EVALUATE CQX-COD-COASEG                            23.05.16
001234                 WHEN LIT-COASEG-VITALICIO                        23.05.16
001235                   MOVE LIT-C9999  TO ARR-COASEGURADORA(VAR-IND)  23.05.16
001236                 WHEN LIT-COASEG-REUNIDOS                         23.05.16
001237                   MOVE LIT-C0031  TO ARR-COASEGURADORA(VAR-IND)  23.05.16
001238                 WHEN LIT-COASEG-MAPFRE                           23.05.16
001239                   MOVE LIT-C0511  TO ARR-COASEGURADORA(VAR-IND)  23.05.16
001240                 WHEN LIT-COASEG-ULTRA                            23.05.16
001241                   MOVE LIT-C0517   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001242                 WHEN LIT-COASEG-SANTANDER                        23.05.16
001243                   MOVE LIT-C0037   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001244                 WHEN LIT-COASEG-AXA                              23.05.16
001245                   MOVE LIT-C0711   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001246                 WHEN LIT-COASEG-VIDACAIXA                        23.05.16
001247                   MOVE LIT-C0611   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001248                 WHEN LIT-COASEG-MUSINI                           23.05.16
001249                   MOVE LIT-C9999   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001250                 WHEN LIT-COASEG-AEGON                            23.05.16
001251                   MOVE LIT-C0789   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001252                 WHEN LIT-COASEG-GENERALI                         23.05.16
001253                   MOVE LIT-C0072   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001254                 WHEN LIT-COASEG-ATLANTIS                         23.05.16
001255                   MOVE LIT-C0744   TO ARR-COASEGURADORA(VAR-IND) 23.05.16
001256               END-EVALUATE                                       23.05.16
001257           MOVE LIT-ALMOHADILLA     TO ARR-ALMOHADILLA(VAR-IND)   23.05.16
001258           MOVE CQX-POR-PARTIC      TO ARR-POR-PARTIC(VAR-IND)    23.05.16
001259           MOVE LIT-ALMOHADILLA     TO ARR-ALMOHADILLA1(VAR-IND)  23.05.16
001260                                                                  23.05.16
001261*           DISPLAY 'ARR-COASEGURADORA(VAR-IND): '                23.05.16
001262*                                  ARR-COASEGURADORA(VAR-IND)     23.05.16
001263*           DISPLAY 'ARR-POR-PARTIC(VAR-IND: '                    23.05.16
001264*                                  ARR-POR-PARTIC(VAR-IND)        23.05.16
001265                                                                  23.05.16
001266           END-IF                                                 23.05.16
001267                                                                  23.05.16
001268        END-IF                                                    23.05.16
001269     END-IF                                                       23.05.16
001270     .                                                            23.05.16
001271*                                                                 23.05.16
001272***************************************************************   23.05.16
001273 2220-FETCH-CURSOR-COASEG.                                        23.05.16
001274***************************************************************   23.05.16
001275*     DISPLAY '2220-FETCH-CURSOR-COASEG '                         23.05.16
001276     EXEC SQL                                                     23.05.16
001277         FETCH CURSOR-COASEG                                      23.05.16
001278         INTO                                                     23.05.16
001279               :CQX-COD-COASEG,                                   23.05.16
001280               :CQX-POR-PARTIC,                                   23.05.16
001281               :CQX-POR-DISTGINT                                  23.05.16
001282     END-EXEC                                                     23.05.16
001283                                                                  23.05.16
001284     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001285                                                                  23.05.16
001286     IF SQLCODE NOT EQUAL TO ZERO                                 23.05.16
001287        IF SQLCODE EQUAL TO CTE-SQL-100                           23.05.16
001288           SET FIN-CURSOR-COASEG TO TRUE                          23.05.16
001289        ELSE                                                      23.05.16
001290           INITIALIZE CRT2-CDSPCRT2                               23.05.16
001291*                                                                 23.05.16
001292           MOVE LIT-E                TO CRT2-COD-TIPO-ERROR       23.05.16
001293           MOVE LIT-PROGRAMA         TO CRT2-COD-PROG-ERR         23.05.16
001294           MOVE LIT-PARRAFO-2220     TO CRT2-COD-PARR-ERR         23.05.16
001295           MOVE LIT-PARRAFO-2220     TO CRT2-DES-ERROR            23.05.16
001296           MOVE LIT-TDSPCCQX         TO CRT2-COD-TABL-ERR         23.05.16
001297           MOVE CO-SQLCODE           TO CRT2-COD-SQLCODE          23.05.16
001298           MOVE CAX-COD-BANCO        TO CRT2-COD-BANCO            23.05.16
001299           MOVE CAX-COD-POLIZPSC     TO CRT2-COD-POLIZPSC         23.05.16
001300                                                                  23.05.16
001301           PERFORM 6300-GRABAR-ERROR                              23.05.16
001302                                                                  23.05.16
001303           MOVE CTE-E                TO XTI-AVIERROR-QPIPCCAB     23.05.16
001304           MOVE LIT-PROGRAMA         TO COD-MODULO-ERR-QPIPCCAB   23.05.16
001305           MOVE LIT-TDSPCCQX         TO COD-TABLA-ERR-QPIPCCAB    23.05.16
001306           MOVE LIT-PARRAFO-2220     TO COD-PARRAFO-ERR-QPIPCCAB  23.05.16
001307           MOVE LIT-DB2              TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
001308           MOVE SQLCODE              TO QNU-SQLCODE-ERR-QPIPCCAB  23.05.16
001309                                                                  23.05.16
001310           PERFORM 9999-ERROR-GENERAL                             23.05.16
001311        END-IF                                                    23.05.16
001312     END-IF                                                       23.05.16
001313                                                                  23.05.16
001314*     DISPLAY 'CQX-COD-COASEG:  ' CQX-COD-COASEG                  23.05.16
001315*     DISPLAY 'CQX-POR-PARTIC:  ' CQX-POR-PARTIC                  23.05.16
001316*     DISPLAY 'CQX-POR-DISTGINT:  ' CQX-POR-DISTGINT              23.05.16
001317                                                                  23.05.16
001318     .                                                            23.05.16
001319*                                                                 23.05.16
001320***************************************************************   23.05.16
001321 2250-CERRAR-CURSOR-COASEG.                                       23.05.16
001322***************************************************************   23.05.16
001323                                                                  23.05.16
001324     EXEC SQL                                                     23.05.16
001325         CLOSE CURSOR-COASEG                                      23.05.16
001326     END-EXEC                                                     23.05.16
001327                                                                  23.05.16
001328     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001329                                                                  23.05.16
001330     IF SQLCODE NOT EQUAL TO ZERO                                 23.05.16
001331         INITIALIZE CRT2-CDSPCRT2                                 23.05.16
001332*                                                                 23.05.16
001333         MOVE LIT-E                  TO CRT2-COD-TIPO-ERROR       23.05.16
001334         MOVE LIT-PROGRAMA           TO CRT2-COD-PROG-ERR         23.05.16
001335         MOVE LIT-PARRAFO-2250       TO CRT2-COD-PARR-ERR         23.05.16
001336         MOVE LIT-PARRAFO-2250       TO CRT2-DES-ERROR            23.05.16
001337         MOVE LIT-TDSPCCQX           TO CRT2-COD-TABL-ERR         23.05.16
001338         MOVE CO-SQLCODE             TO CRT2-COD-SQLCODE          23.05.16
001339*                                                                 23.05.16
001340         MOVE CAX-COD-BANCO         TO CRT2-COD-BANCO             23.05.16
001341         MOVE CAX-COD-POLIZPSC      TO CRT2-COD-POLIZPSC          23.05.16
001342*                                                                 23.05.16
001343         PERFORM 6300-GRABAR-ERROR                                23.05.16
001344*                                                                 23.05.16
001345         MOVE CTE-E                  TO XTI-AVIERROR-QPIPCCAB     23.05.16
001346         MOVE LIT-PROGRAMA           TO COD-MODULO-ERR-QPIPCCAB   23.05.16
001347         MOVE LIT-TDSPCCQX           TO COD-TABLA-ERR-QPIPCCAB    23.05.16
001348         MOVE LIT-PARRAFO-2250       TO COD-PARRAFO-ERR-QPIPCCAB  23.05.16
001349         MOVE LIT-DB2                TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
001350         MOVE SQLCODE                TO QNU-SQLCODE-ERR-QPIPCCAB  23.05.16
001351                                                                  23.05.16
001352         PERFORM 9999-ERROR-GENERAL                               23.05.16
001353     END-IF.                                                      23.05.16
001354*                                                                 23.05.16
001355******************************************************************23.05.16
001356* 2300-TIPO-GARANTIA                                             *23.05.16
001357******************************************************************23.05.16
001358 2300-TIPO-GARANTIA.                                              23.05.16
001359                                                                  23.05.16
001360*     DISPLAY '2300-TIPO-GARANTIA'                                23.05.16
001361                                                                  23.05.16
001362     MOVE CAX-COD-BANCO        TO CDX-COD-BANCO                   23.05.16
001363     MOVE CAX-COD-POLIZPSC     TO CDX-COD-POLIZPSC                23.05.16
001364     MOVE LIT-RN               TO CDX-XTI-PRESTACI                23.05.16
001365                                                                  23.05.16
001366*    DISPLAY 'CDX-COD-BANCO: ' CDX-COD-BANCO                      23.05.16
001367*     DISPLAY 'CDX-COD-POLIZPSC: ' CDX-COD-POLIZPSC               23.05.16
001368*     DISPLAY 'CDX-XTI-PRESTACI: ' CDX-XTI-PRESTACI               23.05.16
001369                                                                  23.05.16
001370                                                                  23.05.16
001371     EXEC SQL                                                     23.05.16
001372         SELECT                                                   23.05.16
001373                COD_POLIZPSC                                      23.05.16
001374         INTO                                                     23.05.16
001375                :CDX-COD-POLIZPSC                                 23.05.16
001376         FROM TDSPCCDX                                            23.05.16
001377         WHERE                                                    23.05.16
001378               COD_BANCO    = :CDX-COD-BANCO    AND               23.05.16
001379               COD_POLIZPSC = :CDX-COD-POLIZPSC AND               23.05.16
001380               XTI_PRESTACI = :CDX-XTI-PRESTACI                   23.05.16
001381                                                                  23.05.16
001382     END-EXEC                                                     23.05.16
001383                                                                  23.05.16
001384     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001385                                                                  23.05.16
001386     EVALUATE SQLCODE                                             23.05.16
001387       WHEN ZEROS                                                 23.05.16
001388       WHEN CTE-SQL-811                                           23.05.16
001389          SET SI-RENTAS           TO TRUE                         23.05.16
001390       WHEN CTE-100                                               23.05.16
001391          SET NO-RENTAS           TO TRUE                         23.05.16
001392       WHEN OTHER                                                 23.05.16
001393                                                                  23.05.16
001394            MOVE LIT-2300          TO CRT2-COD-PARR-ERR           23.05.16
001395            MOVE LIT-CONSULTA-CDX  TO CRT2-DES-ERROR              23.05.16
001396            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001397            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001398            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001399                                                                  23.05.16
001400            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001401            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001402                                                                  23.05.16
001403            PERFORM 6300-GRABAR-ERROR                             23.05.16
001404                                                                  23.05.16
001405            MOVE LIT-E              TO XTI-AVIERROR-QPIPCCAB      23.05.16
001406            MOVE LIT-PROGRAMA       TO COD-MODULO-ERR-QPIPCCAB    23.05.16
001407            MOVE LIT-TDSPCCDX       TO COD-TABLA-ERR-QPIPCCAB     23.05.16
001408            MOVE LIT-2300           TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
001409            MOVE LIT-DB2            TO COD-ACCESO-ERR-QPIPCCAB    23.05.16
001410            MOVE SQLCODE            TO QNU-SQLCODE-ERR-QPIPCCAB   23.05.16
001411                                                                  23.05.16
001412            PERFORM 9999-ERROR-GENERAL                            23.05.16
001413                                                                  23.05.16
001414     END-EVALUATE                                                 23.05.16
001415                                                                  23.05.16
001416     MOVE LIT-CA                TO CDX-XTI-PRESTACI               23.05.16
001417                                                                  23.05.16
001418     EXEC SQL                                                     23.05.16
001419         SELECT                                                   23.05.16
001420                COD_POLIZPSC                                      23.05.16
001421         INTO                                                     23.05.16
001422                :CDX-COD-POLIZPSC                                 23.05.16
001423         FROM TDSPCCDX                                            23.05.16
001424         WHERE                                                    23.05.16
001425               COD_BANCO    = :CDX-COD-BANCO    AND               23.05.16
001426               COD_POLIZPSC = :CDX-COD-POLIZPSC AND               23.05.16
001427               XTI_PRESTACI = :CDX-XTI-PRESTACI                   23.05.16
001428                                                                  23.05.16
001429     END-EXEC                                                     23.05.16
001430                                                                  23.05.16
001431     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001432                                                                  23.05.16
001433     EVALUATE SQLCODE                                             23.05.16
001434       WHEN ZEROS                                                 23.05.16
001435       WHEN CTE-SQL-811                                           23.05.16
001436          SET SI-AHORRO           TO TRUE                         23.05.16
001437       WHEN CTE-100                                               23.05.16
001438          SET NO-AHORRO           TO TRUE                         23.05.16
001439       WHEN OTHER                                                 23.05.16
001440                                                                  23.05.16
001441            MOVE LIT-2300          TO CRT2-COD-PARR-ERR           23.05.16
001442            MOVE LIT-CONSULTA-CDX  TO CRT2-DES-ERROR              23.05.16
001443            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001444            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001445            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001446                                                                  23.05.16
001447            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001448            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001449                                                                  23.05.16
001450            PERFORM 6300-GRABAR-ERROR                             23.05.16
001451                                                                  23.05.16
001452            MOVE LIT-E              TO XTI-AVIERROR-QPIPCCAB      23.05.16
001453            MOVE LIT-PROGRAMA       TO COD-MODULO-ERR-QPIPCCAB    23.05.16
001454            MOVE LIT-TDSPCCDX       TO COD-TABLA-ERR-QPIPCCAB     23.05.16
001455            MOVE LIT-2300           TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
001456            MOVE LIT-DB2            TO COD-ACCESO-ERR-QPIPCCAB    23.05.16
001457            MOVE SQLCODE            TO QNU-SQLCODE-ERR-QPIPCCAB   23.05.16
001458                                                                  23.05.16
001459            PERFORM 9999-ERROR-GENERAL                            23.05.16
001460                                                                  23.05.16
001461     END-EVALUATE                                                 23.05.16
001462                                                                  23.05.16
001463     IF SI-RENTAS                                                 23.05.16
001464        MOVE LIT-RENTAS             TO CTRE-SUBRAMO               23.05.16
001465     END-IF                                                       23.05.16
001466     IF SI-AHORRO                                                 23.05.16
001467        MOVE LIT-AHORRO             TO CTRE-SUBRAMO               23.05.16
001468     END-IF                                                       23.05.16
001469     IF SI-RENTAS AND SI-AHORRO                                   23.05.16
001470        MOVE LIT-AHORRO             TO CTRE-SUBRAMO               23.05.16
001471     END-IF                                                       23.05.16
001472                                                                  23.05.16
001473*     DISPLAY 'CTRE-SUBRAMO: ' CTRE-SUBRAMO                       23.05.16
001474     .                                                            23.05.16
001475                                                                  23.05.16
001476                                                                  23.05.16
001477******************************************************************23.05.16
001478* 2600-OBTENER-IMPORTES                                        *  23.05.16
001479******************************************************************23.05.16
001480 2600-OBTENER-IMPORTES.                                           23.05.16
001481                                                                  23.05.16
001482*     DISPLAY '2600-PROCESO-SUPLEMENTO'                           23.06.05
001483     IF CTR1-NUM-RECIBO-PLAT(1:4) EQUAL LIT-MANU                  23.06.05
001486         SET SI-MANUAL        TO TRUE                             23.05.16
001487     ELSE                                                         23.05.16
001488         SET NO-MANUAL        TO TRUE                             23.05.16
001489     END-IF                                                       23.05.16
001490                                                                  23.05.16
001491                                                                  23.05.16
001492     MOVE CTN-0             TO WS-PRIMA-TOTAL-ACX                 23.05.26
001493     MOVE CTN-0             TO WS-PRIMA-NETA-ACX                  23.05.28
001494     MOVE CTN-0             TO WS-PRIMA-NETA-MANU                 23.05.28
001494     MOVE CTN-0             TO WS-PRIMAPUR-ACX                    23.05.26
001494     MOVE CTN-0             TO WS-CCS-IMPORTE-ACX                 23.05.26
001495     MOVE CTN-0             TO WS-CLEA-IMPORTE-ACX                23.05.26
001496     MOVE CTN-0             TO WS-IPS-IMPORTE-ACX                 23.05.26
001497     MOVE CTN-0             TO WS-CPN-IMPORTE-ACX                 23.05.26
001498     MOVE CTN-0             TO WS-GASINT                          23.05.16
001499     MOVE CTN-0             TO WS-GASINT-TOT                      23.05.16
001500     MOVE CTN-0             TO WS-GASINT-1                        23.05.16
001501     MOVE CTN-0             TO WS-GASINT-2                        23.05.16
001502                                                                  23.05.16
001503     IF SI-MANUAL                                                 23.05.16
001504        INITIALIZE WS-GASINT-COA                                  23.06.05
001506        COMPUTE WS-PRIMA-TOTAL-ACX ROUNDED = (CTR1-PRIMA-NETA +   23.06.05
001506                CTR1-CONSORCIO + CTR1-LEA + CTR1-IPS +            23.05.16
001507                CTR1-COMISION ) * 100 / WS-POR-PARTIC-ABRIDORA    23.05.16
001508                                                                  23.06.05
001516        MOVE WS-PRIMA-TOTAL-ACX     TO CTRE-PRIMA-TOTAL           23.05.26
001517                                                                  23.06.05
001519        COMPUTE WS-PRIMA-NETA-MANU ROUNDED =                      23.05.28
001520                CTR1-PRIMA-NETA * (100 /                          23.05.26
001520                WS-POR-PARTIC-ABRIDORA)                           23.05.16
001521        MOVE WS-PRIMA-NETA-MANU  TO CTRE-PRIMA-NETA               23.05.28
001522        COMPUTE WS-CCS-IMPORTE-ACX ROUNDED                        23.06.05
001525                = CTR1-CONSORCIO * (100 /                         23.05.26
001525                WS-POR-PARTIC-ABRIDORA)                           23.05.16
001526        MOVE WS-CCS-IMPORTE-ACX     TO CTRE-CCS-IMPORTE           23.05.26
001527                                                                  23.06.05
001529        COMPUTE WS-CLEA-IMPORTE-ACX ROUNDED = CTR1-LEA * (100 /   23.05.26
001530                WS-POR-PARTIC-ABRIDORA)                           23.05.16
001531        MOVE WS-CLEA-IMPORTE-ACX     TO CTRE-CLEA-IMPORTE         23.05.26
001532                                                                  23.06.05
001534        COMPUTE WS-IPS-IMPORTE-ACX ROUNDED = CTR1-IPS * (100 /    23.05.26
001535                WS-POR-PARTIC-ABRIDORA)                           23.05.16
001536        MOVE WS-IPS-IMPORTE-ACX     TO CTRE-IPS-IMPORTE           23.05.26
001537                                                                  23.06.05
001539        COMPUTE WS-CPN-IMPORTE-ACX ROUNDED = CTR1-COMISION        23.05.26
001540*        * (100 /                                                 23.05.16
001541*                WS-POR-PARTIC-ABRIDORA)                          23.05.16
001542        MOVE WS-CPN-IMPORTE-ACX     TO CTRE-CPN-IMPORTE           23.05.26
001543                                                                  23.06.05
001545     ELSE                                                         23.05.16
001546                                                                  23.06.05
001547        PERFORM 2650-OBTENER-DATOS-FAX                            23.05.16
001548                                                                  23.05.25
001549        IF NO-ERROR-GRAVE                                         23.05.25
001549           PERFORM 2652-OBTENER-DATOS-ZFX                         23.05.25
001550        END-IF                                                    23.05.25
001551                                                                  23.05.25
001553     END-IF                                                       23.05.25
001587                                                                  23.05.16
001588     IF NO-ERROR-GRAVE                                            23.05.16
001589        PERFORM 2663-INFORMAR-SALIDA                              23.05.16
001590     END-IF                                                       23.05.16
001591                                                                  23.05.16
001592     IF NO-ERROR-GRAVE                                            23.05.16
001593        PERFORM 2680-INFORMAR-IMP-ABRIDORA                        23.05.16
001594        MOVE 1                       TO VAR-IND                   23.05.16
001595        PERFORM 2700-PROCESO-COASEGURADORAS                       23.05.16
001596          UNTIL ARR-COASEGURADORA(VAR-IND) = SPACES               23.05.16
001597             OR LOW-VALUES OR VAR-IND = 6                         23.05.16
001598        MOVE 0                       TO WS-PRIMA-TOTAL-TOT        23.05.16
001599                                        WS-PRIMA-TOTAL-C          23.05.16
001600                                        WS-PRIMA-NETA-TOT         23.05.16
001601                                        WS-LIQUIDO-TOT            23.05.16
001602                                        WS-GASTOS-ADMIN-TOT       23.05.16
001603                                        WS-CCS-IMPORTE-TOT        23.05.16
001604                                        WS-CLEA-IMPORTE-TOT       23.05.16
001605                                        WS-IPS-IMPORTE-TOT        23.05.16
001606                                        WS-CPN-IMPORTE-TOT        23.05.16
001607     END-IF                                                       23.05.16
001608                                                                  23.05.16
001609      .                                                           23.05.16
001610                                                                  23.05.16
001611******************************************************************23.05.16
001612* 2663-INFORMAR-SALIDA                                           *23.05.16
001613* SE INFORMA LA SALIDA                                           *23.05.16
001614******************************************************************23.05.16
001615 2663-INFORMAR-SALIDA.                                            23.05.16
001616                                                                  23.05.16
001617*     DISPLAY '2663-INFORMAR-SALIDA'                              23.05.16
001618                                                                  23.05.16
001619       IF  WS-PRIMA-TOTAL-ACX < 0                                 23.05.26
001620          MOVE LIT-BACK                                           23.05.16
001621            TO CTRE-CLASE-RECIBO                                  23.05.16
001622      ELSE                                                        23.05.16
001623          MOVE LIT-NEW-PRODUCTION                                 23.05.16
001624            TO CTRE-CLASE-RECIBO                                  23.05.16
001625      END-IF                                                      23.05.16
001626                                                                  23.05.16
001627                                                                  23.05.16
001628                                                                  23.05.16
001629*      MOVE CTN-0                TO CTRE-PB                       23.05.16
001630*      MOVE CTN-0                TO CTRE-RECARGO-PAFRACCIONADO    23.05.16
001631      MOVE CTN-0                TO CTRE-GASTOS-ADMIN              23.05.16
001632      MOVE CTN-0                TO CTRE-IVA-GASTOS-ADMIN          23.05.16
001633      MOVE CTRE-PRIMA-TOTAL     TO CTRE-LIQUIDO                   23.05.16
001634                                                                  23.05.16
001635      PERFORM 6100-GRABAR-SALIDA1                                 23.05.16
001636     .                                                            23.05.16
001637                                                                  23.05.16
001638******************************************************************23.05.16
001639* 2680-INFORMAR-IMP-ABRIDORA                                     *23.05.16
001640******************************************************************23.05.16
001641* SE INFORMAN LOS IMPORTES CORRESPONDIENTES A LA ABRIDORA         23.05.16
001642 2680-INFORMAR-IMP-ABRIDORA.                                      23.05.16
001643                                                                  23.05.16
001644*     DISPLAY '2680-INFORMAR-IMP-ABRIDORA '                       23.06.05
001645     MOVE LIT-RECIBO-CES             TO CTRE-TIPO-REGISTRO-C      23.05.16
001646                                                                  23.05.16
001647     MOVE LIT-C0502                  TO CTRE-ENT-ACEPTANTE-C      23.05.16
001648                                                                  23.05.16
001649     MOVE CTR1-NUM-RECIBO            TO CTRE-NUMERO-RECACE-C      23.05.16
001650                                                                  23.05.16
001651     MOVE CTN-0                      TO CTRE-GASTOS-ADMIN-C       23.05.16
001652                                                                  23.05.16
001653     MOVE CTN-0                      TO CTRE-IVA-GASTOS-ADMIN-C   23.05.16
001654                                                                  23.05.16
001655     MOVE CTN-0                      TO CTRE-CCSRE-IMPORTE-C      23.05.16
001656                                                                  23.06.05
001662*L-0005-INI                                                       23.05.16
001663*     COMPUTE WS-GASINT ROUNDED = WS-GASINT-TOT *                 23.05.16
001664*               (WS-POR-PARTIC-ABRIDORA / 100 + (WS-POR-DISTGINT /23.05.16
001664*                100 * (1 - WS-POR-PARTIC-ABRIDORA / 100)))       23.05.16
001665                                                                  23.06.05
001666     COMPUTE WS-PRIMA-NETA ROUNDED = CTR1-PRIMA-NETA + WS-GASINT  23.06.05
001670     COMPUTE WS-PRIMA-NETA ROUNDED = CTR1-PRIMA-NETA              23.05.16
001671*L-0005-FIN                                                       23.05.16
001672     ADD WS-PRIMA-NETA               TO WS-PRIMA-NETA-TOT         23.05.16
001673     MOVE WS-PRIMA-NETA              TO CTRE-PRIMA-NETA-C         23.05.16
001674     MOVE CTN-0                      TO WS-GASINT                 23.05.16
001675                                                                  23.05.16
001676*     DISPLAY 'WS-POR-PARTIC-ABRIDORA: ' WS-POR-PARTIC-ABRIDORA   23.06.05
001680*     DISPLAY 'WS-CCS-IMPORTE-TOT: ' WS-CCS-IMPORTE-TOT           23.05.16
001681                                                                  23.05.16
001682     COMPUTE WS-CCS-IMPORTE ROUNDED = CTR1-CONSORCIO              23.05.16
001683     ADD WS-CCS-IMPORTE              TO WS-CCS-IMPORTE-TOT        23.05.16
001684     MOVE WS-CCS-IMPORTE             TO CTRE-CCS-IMPORTE-C        23.05.16
001685                                                                  23.06.05
001688*     DISPLAY 'WS-CCS-IMPORTE-TOT: ' WS-CCS-IMPORTE-TOT           23.05.16
001689                                                                  23.05.16
001690     COMPUTE WS-CLEA-IMPORTE ROUNDED = CTR1-LEA                   23.05.16
001691     ADD WS-CLEA-IMPORTE             TO WS-CLEA-IMPORTE-TOT       23.05.16
001692     MOVE WS-CLEA-IMPORTE            TO CTRE-CLEA-IMPORTE-C       23.05.16
001693                                                                  23.06.05
001696     COMPUTE WS-IPS-IMPORTE ROUNDED = CTR1-IPS                    23.05.16
001697     ADD WS-IPS-IMPORTE              TO WS-IPS-IMPORTE-TOT        23.05.16
001698     MOVE WS-IPS-IMPORTE             TO CTRE-IPS-IMPORTE-C        23.05.16
001699                                                                  23.06.05
001702* Se comenta código hasta que se aclare el reparto de comision    23.05.16
001703     COMPUTE WS-CPN-IMPORTE ROUNDED = WS-CPN-IMPORTE-ACX          23.05.26
001704*                                  (WS-POR-PARTIC-ABRIDORA / 100) 23.05.16
001705*     ADD WS-CPN-IMPORTE              TO WS-CPN-IMPORTE-TOT       23.05.16
001706*     MOVE WS-CPN-IMPORTE             TO CTRE-CPN-IMPORTE-C       23.05.16
001707                                                                  23.05.16
001708     MOVE WS-CPN-IMPORTE             TO CTRE-CPN-IMPORTE-C        23.05.16
001709                                                                  23.05.16
001710*     DISPLAY 'WS-CCS-IMPORTE: ' WS-CCS-IMPORTE                   23.05.16
001711*     DISPLAY 'WS-CLEA-IMPORTE: ' WS-CLEA-IMPORTE                 23.05.16
001712*     DISPLAY 'WS-IPS-IMPORTE: ' WS-IPS-IMPORTE                   23.05.16
001713                                                                  23.05.16
001714*     DISPLAY 'WS-PRIMA-TOTAL: ' WS-PRIMA-TOTAL                   23.05.16
001715                                                                  23.06.05
001717     COMPUTE WS-PRIMA-TOTAL ROUNDED = WS-PRIMA-NETA +             23.05.16
001718             WS-CCS-IMPORTE + WS-CLEA-IMPORTE + WS-IPS-IMPORTE    23.05.16
001719             + WS-CPN-IMPORTE                                     23.05.16
001720                                                                  23.06.05
001721     ADD WS-PRIMA-TOTAL              TO WS-PRIMA-TOTAL-TOT        23.05.16
001722     MOVE WS-PRIMA-TOTAL             TO CTRE-PRIMA-TOTAL-C        23.05.16
001723                                                                  23.06.05
001726     COMPUTE WS-LIQUIDO ROUNDED = WS-PRIMA-TOTAL                  23.05.16
001727     ADD WS-LIQUIDO                  TO WS-LIQUIDO-TOT            23.05.16
001728     MOVE WS-LIQUIDO                 TO CTRE-LIQUIDO-C            23.05.16
001729                                                                  23.06.05
001732*     DISPLAY 'WS-PRIMA-TOTAL: ' WS-PRIMA-TOTAL                   23.05.16
001733                                                                  23.05.16
001734     PERFORM 6200-GRABAR-SALIDA1                                  23.05.16
001735     .                                                            23.05.16
001736                                                                  23.05.16
001737******************************************************************23.05.16
001738* 2700-PROCESO-COASEGURADORAS                                    *23.05.16
001739******************************************************************23.05.16
001740* SE INFORMAN LOS IMPORTES CORRESPONDIENTES A CADA UNA DE LAS     23.05.16
001741* ASEGURADORAS                                                    23.05.16
001742 2700-PROCESO-COASEGURADORAS.                                     23.05.16
001743                                                                  23.05.16
001744*     DISPLAY '2700-PROCESO-COASEGURADORAS'                       23.06.05
001745     MOVE LIT-RECIBO-CES             TO CTRE-TIPO-REGISTRO-C      23.05.16
001746                                                                  23.05.16
001747     MOVE ARR-COASEGURADORA(VAR-IND) TO CTRE-ENT-ACEPTANTE-C      23.06.05
001750     MOVE CTN-0                      TO CTRE-NUMERO-RECACE-C      23.05.16
001751     MOVE CTN-0                      TO CTRE-CCSRE-IMPORTE-C      23.05.16
001752     MOVE ARR-POR-PARTIC(VAR-IND)    TO WS-POR-PARTIC-ACEPTANTE   23.05.16
001753                                                                  23.06.05
001758     IF VAR-IND = WS-IND-TOT                                      23.05.16
001759                                                                  23.05.16
001760*        DISPLAY 'CALCULO GASTOS INTERNOS ACEPTANTE ULT'          23.06.05
001761                                                                  23.05.25
001764        IF SI-MANUAL                                              23.05.16
001765           DISPLAY 'MANUAL'                                       23.05.16
001766           COMPUTE CTRE-PRIMA-NETA-C =                            23.05.16
001767                WS-PRIMA-NETA-MANU - WS-PRIMA-NETA-TOT            23.05.28
001768           DISPLAY 'CTRE-PRIMA-NETA-C: ' CTRE-PRIMA-NETA-C        23.05.16
001769           DISPLAY 'WS-PRIMA-NETA-MANU: ' WS-PRIMA-NETA-MANU      23.05.28
001770           DISPLAY 'WS-PRIMA-NETA-TOT: ' WS-PRIMA-NETA-TOT        23.05.16
001771           COMPUTE CTRE-PRIMA-TOTAL-C =                           23.05.16
001772                WS-PRIMA-TOTAL-ACX - WS-PRIMA-TOTAL-TOT           23.05.26
001773           DISPLAY 'CTRE-PRIMA-TOTAL-C: ' CTRE-PRIMA-TOTAL-C      23.05.16
001774           DISPLAY 'WS-PRIMA-TOTAL-ACX: ' WS-PRIMA-TOTAL-ACX      23.05.26
001775           DISPLAY 'WS-PRIMA-TOTAL-TOT: ' WS-PRIMA-TOTAL-TOT      23.05.16
001776                                                                  23.05.16
001777           COMPUTE CTRE-LIQUIDO-C =                               23.05.16
001778                WS-PRIMA-TOTAL-ACX - WS-PRIMA-TOTAL-TOT           23.05.26
001779           DISPLAY 'CTRE-LIQUIDO-C:  CTRE-LIQUIDO-C'              23.05.16
001780        ELSE                                                      23.05.16
001781           DISPLAY 'NO MANUAL'                                    23.05.16
001782                                                                  23.05.16
001783           COMPUTE CTRE-PRIMA-NETA-C =                            23.05.16
001784                WS-PRIMA-NETA-ACX - WS-PRIMA-NETA-TOT             23.05.26
001785           DISPLAY 'CTRE-PRIMA-NETA-C: ' CTRE-PRIMA-NETA-C        23.05.16
001786           DISPLAY 'ACX-IMP-PRIMATAR: ' WS-PRIMA-NETA-ACX         23.05.26
001787           DISPLAY 'WS-PRIMA-NETA-TOT: ' WS-PRIMA-NETA-TOT        23.05.16
001788                                                                  23.05.16
001789           COMPUTE CTRE-PRIMA-TOTAL-C =                           23.05.16
001790                WS-PRIMA-TOTAL-ACX - WS-PRIMA-TOTAL-TOT           23.05.26
001791           DISPLAY 'CTRE-PRIMA-TOTAL-C: ' CTRE-PRIMA-TOTAL-C      23.05.16
001792           DISPLAY 'ACX-IMP-PRIMTOPC: ' WS-PRIMA-TOTAL-ACX        23.05.26
001793           DISPLAY 'WS-PRIMA-TOTAL-TOT: ' WS-PRIMA-TOTAL-TOT      23.05.16
001794                                                                  23.05.16
001795            COMPUTE CTRE-LIQUIDO-C =                              23.05.16
001796                   WS-PRIMA-TOTAL-ACX - WS-PRIMA-TOTAL-TOT        23.05.26
001797           DISPLAY 'CTRE-LIQUIDO-C: ' CTRE-LIQUIDO-C              23.05.16
001798                                                                  23.05.16
001799        END-IF                                                    23.05.16
001800                                                                  23.05.16
001801        COMPUTE CTRE-CCS-IMPORTE-C =                              23.05.16
001802                WS-CCS-IMPORTE-ACX - WS-CCS-IMPORTE-TOT           23.05.26
001803*        DISPLAY 'CTRE-CCS-IMPORTE-C: ' CTRE-CCS-IMPORTE-C        23.06.05
001804*        DISPLAY 'WS-CCS-IMPORTE-ACX: ' WS-CCS-IMPORTE-ACX        23.06.05
001805*        DISPLAY 'WS-CCS-IMPORTE-TOT: ' WS-CCS-IMPORTE-TOT        23.06.05
001806                                                                  23.05.16
001807        COMPUTE CTRE-CLEA-IMPORTE-C =                             23.05.16
001808                WS-CLEA-IMPORTE-ACX - WS-CLEA-IMPORTE-TOT         23.05.26
001809*        DISPLAY 'CTRE-CLEA-IMPORTE-C: ' CTRE-CLEA-IMPORTE-C      23.06.05
001810*        DISPLAY 'WS-CLEA-IMPORTE-ACX: ' WS-CLEA-IMPORTE-ACX      23.06.05
001811*        DISPLAY 'WS-CLEA-IMPORTE-TOT: ' WS-CLEA-IMPORTE-TOT      23.06.05
001812                                                                  23.05.16
001813        COMPUTE CTRE-IPS-IMPORTE-C =                              23.05.16
001814               WS-IPS-IMPORTE-ACX - WS-IPS-IMPORTE-TOT            23.05.26
001815*        DISPLAY 'CTRE-IPS-IMPORTE-C: ' CTRE-IPS-IMPORTE-C        23.06.05
001816*        DISPLAY 'WS-IPS-IMPORTE-ACX: ' WS-IPS-IMPORTE-ACX        23.06.05
001817*        DISPLAY 'WS-IPS-IMPORTE-TOT: ' WS-IPS-IMPORTE-TOT        23.05.16
001818                                                                  23.05.16
001819*Se comenta codigo hasta que se aclare el reparto de comision     23.05.16
001820*        DISPLAY 'ACX-IMP-GASEXT: ' WS-CPN-IMPORTE-ACX            23.05.26
001821*        DISPLAY 'WS-PRIMA-TOTAL-TOT: ' WS-CPN-IMPORTE-TOT        23.05.16
001822*        COMPUTE CTRE-CPN-IMPORTE-C =                             23.05.16
001823*                WS-CPN-IMPORTE-ACX - WS-CPN-IMPORTE-TOT          23.05.26
001824         MOVE CTN-0                  TO CTRE-CPN-IMPORTE-C        23.05.16
001825                                                                  23.05.16
001826     ELSE                                                         23.05.16
001827                                                                  23.05.16
001828        DISPLAY 'CALCULO GASTOS INTERNOS ACEPTANTE'               23.05.19
001829        DISPLAY 'WS-GASINT-TOT: ' WS-GASINT-TOT                   23.05.19
001829        DISPLAY 'WS-GASINT-COA: ' WS-GASINT-COA                   23.05.16
001830        DISPLAY 'WS-POR-DISTGINT: ' WS-POR-DISTGINT               23.05.16
001831        DISPLAY 'WS-POR-PARTIC-ACEPTANTE: '                       23.05.16
001832                 WS-POR-PARTIC-ACEPTANTE                          23.05.16
001832                                                                  23.05.16
001833*L-0005-INI                                                       23.05.16
001834*        COMPUTE WS-GASINT ROUNDED = WS-GASINT-TOT *              23.05.16
001835*               (WS-POR-PARTIC-ACEPTANTE / 100 -                  23.05.16
001836*                   (WS-POR-DISTGINT /                            23.05.16
001837*                100 * WS-POR-PARTIC-ACEPTANTE / 100))            23.05.16
001837*L-0005-FIN                                                       23.05.16
001838                                                                  23.05.16
001839        DISPLAY 'CALCULO PRIMA NETA ACEPTANTE'                    23.05.16
001840        DISPLAY 'WS-GASINT: ' WS-GASINT                           23.05.16
001841        DISPLAY 'WS-PRIMA-NETA-ACX: ' WS-PRIMA-NETA-ACX           23.05.28
001842        DISPLAY 'WS-PRIMA-NETA-MANU: ' WS-PRIMA-NETA-MANU         23.05.28
001843                                                                  23.05.28
001842*L-0005-INI                                                       23.05.19
001845        COMPUTE WS-POR-GAST-COASEG =                              23.05.19
001846                ((WS-POR-PARTIC-ACEPTANTE * 100) /                23.05.19
001847                (100 - WS-POR-PARTIC-ABRIDORA))                   23.05.19
001848        DISPLAY 'WS-POR-PARTIC-ABRIDORA: '                        23.05.19
001849                 WS-POR-PARTIC-ABRIDORA                           23.05.19
001850        DISPLAY 'WS-POR-PARTIC-ACEPTANTE: '                       23.05.19
001851                 WS-POR-PARTIC-ACEPTANTE                          23.05.19
001852        DISPLAY 'WS-POR-GAST-COASEG: ' WS-POR-GAST-COASEG         23.05.19
001853                                                                  23.05.19
001854        COMPUTE WS-GASINT = WS-POR-GAST-COASEG *                  23.05.19
001855                              WS-GASINT-COA / 100                 23.05.19
001848                                                                  23.05.19
001849        DISPLAY 'WS-GASINT-COA: ' WS-GASINT-COA                   23.05.19
001850        DISPLAY 'WS-POR-GAST-COASEG: ' WS-POR-GAST-COASEG         23.05.19
001849        DISPLAY 'WS-GASINT: ' WS-GASINT                           23.05.19
001844                                                                  23.05.28
001845        IF SI-MANUAL                                              23.05.28
001846           COMPUTE WS-PRIMA-NETA ROUNDED = WS-PRIMA-NETA-MANU *   23.05.28
001847               (WS-POR-PARTIC-ACEPTANTE / 100) + WS-GASINT        23.05.28
001848        ELSE                                                      23.05.28
001843           COMPUTE WS-PRIMA-NETA ROUNDED = WS-PRIMAPUR-ACX *      23.05.28
001843               (WS-POR-PARTIC-ACEPTANTE / 100) + WS-GASINT        23.05.28
001844        END-IF                                                    23.05.28
001845*L-0005-FIN                                                       23.05.28
001845        ADD WS-PRIMA-NETA            TO WS-PRIMA-NETA-TOT         23.05.16
001846        MOVE WS-PRIMA-NETA           TO CTRE-PRIMA-NETA-C         23.05.19
001848                                                                  23.05.16
001849        DISPLAY 'WS-PRIMA-NETA: ' WS-PRIMA-NETA                   23.05.16
001850        DISPLAY 'WS-PRIMA-NETA-TOT: ' WS-PRIMA-NETA-TOT           23.05.16
001851        DISPLAY 'CTRE-PRIMA-NETA-C: ' CTRE-PRIMA-NETA-C           23.05.16
001852                                                                  23.05.16
001853        MOVE CTN-0                     TO WS-CCS-IMPORTE          23.05.16
001854        MOVE CTN-0                     TO WS-CLEA-IMPORTE         23.05.16
001855        MOVE CTN-0                     TO WS-IPS-IMPORTE          23.05.16
001856        MOVE CTN-0                     TO CTRE-CPN-IMPORTE-C      23.05.16
001857                                                                  23.05.16
001858        COMPUTE WS-CCS-IMPORTE ROUNDED = WS-CCS-IMPORTE-ACX *     23.05.26
001859               (WS-POR-PARTIC-ACEPTANTE / 100)                    23.05.16
001860        ADD WS-CCS-IMPORTE           TO WS-CCS-IMPORTE-TOT        23.05.16
001861        MOVE WS-CCS-IMPORTE          TO CTRE-CCS-IMPORTE-C        23.05.16
001862                                                                  23.06.05
001866        COMPUTE WS-CLEA-IMPORTE ROUNDED = WS-CLEA-IMPORTE-ACX *   23.05.26
001867               (WS-POR-PARTIC-ACEPTANTE / 100)                    23.05.16
001868        ADD WS-CLEA-IMPORTE          TO WS-CLEA-IMPORTE-TOT       23.05.16
001869        MOVE WS-CLEA-IMPORTE         TO CTRE-CLEA-IMPORTE-C       23.05.16
001870                                                                  23.06.05
001874        COMPUTE WS-IPS-IMPORTE ROUNDED = WS-IPS-IMPORTE-ACX *     23.05.26
001875               (WS-POR-PARTIC-ACEPTANTE / 100)                    23.05.16
001876        ADD WS-IPS-IMPORTE           TO WS-IPS-IMPORTE-TOT        23.05.16
001877        MOVE WS-IPS-IMPORTE          TO CTRE-IPS-IMPORTE-C        23.05.16
001878                                                                  23.06.05
001882* de momento la comisión la dejamos a 0.                          23.05.16
001883*       COMPUTE WS-CPN-IMPORTE ROUNDED = WS-CPN-IMPORTE-ACX *     23.05.26
001884*               (WS-POR-PARTIC-ACEPTANTE / 100)                   23.05.16
001885*        ADD WS-CPN-IMPORTE           TO WS-CPN-IMPORTE-TOT       23.05.16
001886*        MOVE CTN-0                   TO CTRE-CPN-IMPORTE-C       23.05.16
001887                                                                  23.05.16
001888        COMPUTE WS-PRIMA-TOTAL-C ROUNDED = WS-PRIMA-NETA +        23.05.16
001889             WS-CCS-IMPORTE + WS-CLEA-IMPORTE + WS-IPS-IMPORTE    23.05.16
001890                                                                  23.06.05
001896        ADD WS-PRIMA-TOTAL-C           TO WS-PRIMA-TOTAL-TOT      23.05.16
001897        MOVE WS-PRIMA-TOTAL-C          TO CTRE-PRIMA-TOTAL-C      23.05.16
001898                                                                  23.06.05
001901*        DISPLAY 'WS-PRIMA-TOTAL-C: ' WS-PRIMA-TOTAL-C            23.05.16
001902                                                                  23.05.16
001903        MOVE WS-PRIMA-TOTAL-C          TO WS-LIQUIDO              23.05.16
001904        MOVE WS-LIQUIDO                TO CTRE-LIQUIDO-C          23.05.16
001905        DISPLAY 'CTRE-LIQUIDO-C: ' CTRE-LIQUIDO-C                 23.05.16
001906     END-IF                                                       23.05.16
001907                                                                  23.05.16
001908     PERFORM 6200-GRABAR-SALIDA1                                  23.05.16
001909                                                                  23.05.16
001910     ADD 1                           TO VAR-IND                   23.05.16
001911     .                                                            23.05.24
001912                                                                  23.05.25
001913******************************************************************23.05.16
001914* 2650-OBTENER-DATOS-FAX                                        * 23.05.16
001915******************************************************************23.05.16
001916 2650-OBTENER-DATOS-FAX.                                          23.05.16
001917                                                                  23.05.16
001918*     DISPLAY '2650-OBTENER-DATOS-FAX'                            23.06.05
001919                                                                  23.05.16
001920     INITIALIZE  DCLTDSPCFAX                                      23.05.16
001921*                                                                 23.05.16
001922     MOVE CAX-COD-BANCO               TO FAX-COD-BANCO            23.05.16
001923     MOVE CAX-COD-POLIZPSC            TO FAX-COD-POLIZPSC         23.05.16
001924     MOVE CTN-0                       TO FAX-COD-CERTIPSC         23.05.16
001925                                                                  23.05.16
001926* EXTRAEMOS FEC-COBRO DEL FICHERO DE ENTRADA                      23.05.16
001927     MOVE CTR1-NUM-RECIBO-PLAT(5:8)   TO VAR-FEC-FECHA-AIS        23.05.16
001928     MOVE VAR-FEC-ANHO2               TO VAR-FEC-ANHO             23.05.16
001929     MOVE VAR-FEC-MES2                TO VAR-FEC-MES              23.05.16
001930     MOVE VAR-FEC-DIA2                TO VAR-FEC-DIA              23.05.16
001931     MOVE VAR-FEC-FECHA               TO FAX-FEC-COBRO            23.05.16
001932                                                                  23.05.16
001933     MOVE CTR1-NUM-RECIBO-PLAT(13:5)  TO FAX-COD-RECIBOPC         23.05.16
001934                                                                  23.06.05
001942     EXEC SQL                                                     23.05.16
001943         SELECT                                                   23.05.25
001944                COD_SUPLEMEN,                                     23.05.25
001944                FEC_COBRO,                                        23.05.19
001944                XTI_PRIMAPSC,                                     23.05.16
001945                IMP_GASINT                                        23.05.16
001946         INTO                                                     23.05.25
001947                :FAX-COD-SUPLEMEN,                                23.05.25
001947                :FAX-FEC-COBRO,                                   23.05.19
001947                :FAX-XTI-PRIMAPSC,                                23.05.16
001948                :FAX-IMP-GASINT                                   23.05.16
001949         FROM TDSPCFAX                                            23.05.16
001950         WHERE                                                    23.05.16
001951               COD_BANCO      = :FAX-COD-BANCO    AND             23.05.16
001952               COD_POLIZPSC   = :FAX-COD-POLIZPSC AND             23.05.16
001953               COD_CERTIPSC   = :FAX-COD-CERTIPSC AND             23.05.16
001954               FEC_COBRO      = :FAX-FEC-COBRO    AND             23.05.16
001955               COD_RECIBOPC   = :FAX-COD-RECIBOPC                 23.05.16
001956            FETCH FIRST ROW ONLY                                  23.05.16
001957     END-EXEC                                                     23.05.16
001958                                                                  23.05.16
001959     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
001960                                                                  23.05.16
001961     EVALUATE SQLCODE                                             23.05.16
001962       WHEN ZEROS                                                 23.05.16
001963          CONTINUE                                                23.05.16
001964       WHEN CTE-100                                               23.05.16
001965                                                                  23.05.16
001966            MOVE LIT-2650          TO CRT2-COD-PARR-ERR           23.05.16
001967            MOVE LIT-CONSULTA-FAX  TO CRT2-DES-ERROR              23.05.16
001968            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001969            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001970            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001971                                                                  23.05.16
001972            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001973            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001974                                                                  23.05.16
001975            PERFORM 6300-GRABAR-ERROR                             23.05.16
001976                                                                  23.05.16
001977            SET SI-ERROR-GRAVE     TO TRUE                        23.05.16
001978                                                                  23.05.16
001979       WHEN OTHER                                                 23.05.16
001980                                                                  23.05.16
001981            MOVE LIT-2650          TO CRT2-COD-PARR-ERR           23.05.16
001982            MOVE LIT-CONSULTA-FAX  TO CRT2-DES-ERROR              23.05.16
001983            MOVE CO-SQLCODE        TO CRT2-COD-ERROR              23.05.16
001984            MOVE LIT-E             TO CRT2-COD-TIPO-ERROR         23.05.16
001985            MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR           23.05.16
001986                                                                  23.05.16
001987            MOVE CAX-COD-BANCO    TO CRT2-COD-BANCO               23.05.16
001988            MOVE CAX-COD-POLIZPSC TO CRT2-COD-POLIZPSC            23.05.16
001989                                                                  23.05.16
001990            PERFORM 6300-GRABAR-ERROR                             23.05.16
001991                                                                  23.05.16
001992            MOVE LIT-E              TO XTI-AVIERROR-QPIPCCAB      23.05.16
001993            MOVE LIT-PROGRAMA       TO COD-MODULO-ERR-QPIPCCAB    23.05.16
001994            MOVE LIT-TDSPCFAX       TO COD-TABLA-ERR-QPIPCCAB     23.05.16
001995            MOVE LIT-2650           TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
001996            MOVE LIT-DB2            TO COD-ACCESO-ERR-QPIPCCAB    23.05.16
001997            MOVE SQLCODE            TO QNU-SQLCODE-ERR-QPIPCCAB   23.05.16
001998                                                                  23.05.16
001999            PERFORM 9999-ERROR-GENERAL                            23.05.16
002000                                                                  23.05.16
002001     END-EVALUATE                                                 23.05.24
002002     .                                                            23.05.25
002003                                                                  23.05.25
002004******************************************************************23.05.25
002005* 2652-OBTENER-DATOS-ZFX                                        * 23.05.25
002006******************************************************************23.05.25
002007 2652-OBTENER-DATOS-ZFX.                                          23.05.25
002008                                                                  23.05.25
002009*     DISPLAY '2650-OBTENER-DATOS-ZFX'                            23.06.05
002010                                                                  23.05.25
002011     SET NO-FIN-CURSOR-ZFX            TO TRUE                     23.05.25
002010                                                                  23.05.25
002011     INITIALIZE  DCLTDSPCZFX                                      23.05.25
002012*                                                                 23.05.25
002013     MOVE CAX-COD-BANCO               TO ZFX-COD-BANCO            23.05.25
002014     MOVE CAX-COD-POLIZPSC            TO ZFX-COD-POLIZPSC         23.05.25
002015     MOVE FAX-FEC-COBRO               TO ZFX-FEC-FACTURPC         23.05.25
002016                                                                  23.06.05
002015     PERFORM 2653-ABRIR-CURSOR-ZFX                                23.05.25
002016                                                                  23.05.25
002017     PERFORM 2654-PROCESO-CURSOR-ZFX                              23.05.25
002018       UNTIL FIN-CURSOR-ZFX                                       23.05.25
002019          OR SI-ERROR-GRAVE                                       23.05.25
002020                                                                  23.05.25
002021     PERFORM 2657-CERRAR-CURSOR-ZFX                               23.05.25
002022     .                                                            23.05.25
002016                                                                  23.05.25
002017******************************************************************23.05.25
002018* 2653-ABRIR-CURSOR-ZFX                                        *  23.05.25
002019******************************************************************23.05.25
002020 2653-ABRIR-CURSOR-ZFX.                                           23.05.25
002021                                                                  23.05.25
002022*     DISPLAY '2653-ABRIR-CURSOR-ZFX'                             23.05.25
002016                                                                  23.05.25
002029     EXEC SQL                                                     23.05.25
002030          OPEN CURSOR-ZFX                                         23.05.25
002031     END-EXEC.                                                    23.05.25
002032                                                                  23.05.25
002033     MOVE SQLCODE TO CO-SQLCODE                                   23.05.25
002034                                                                  23.05.25
002035     IF SQLCODE NOT EQUAL TO ZERO                                 23.05.25
002034                                                                  23.05.25
002035         INITIALIZE CRT2-CDSPCRT2                                 23.05.25
002036*                                                                 23.05.25
002037         MOVE LIT-E                  TO CRT2-COD-TIPO-ERROR       23.05.25
002038         MOVE LIT-PROGRAMA           TO CRT2-COD-PROG-ERR         23.05.25
002039         MOVE LIT-PARRAFO-2653       TO CRT2-COD-PARR-ERR         23.05.25
002040         MOVE LIT-PARRAFO-2653       TO CRT2-DES-ERROR            23.05.25
002041         MOVE LIT-TDSPCZFX           TO CRT2-COD-TABL-ERR         23.05.25
002042         MOVE CO-SQLCODE             TO CRT2-COD-SQLCODE          23.05.25
002043                                                                  23.05.25
002044         MOVE CAX-COD-BANCO         TO CRT2-COD-BANCO             23.05.25
002045         MOVE CAX-COD-POLIZPSC      TO CRT2-COD-POLIZPSC          23.05.25
002046*                                                                 23.05.25
002047         PERFORM 6300-GRABAR-ERROR                                23.05.25
002048                                                                  23.05.25
002049         MOVE CTE-E                  TO XTI-AVIERROR-QPIPCCAB     23.05.25
002050         MOVE LIT-PROGRAMA           TO COD-MODULO-ERR-QPIPCCAB   23.05.25
002051         MOVE LIT-TDSPCZFX           TO COD-TABLA-ERR-QPIPCCAB    23.05.25
002052         MOVE LIT-PARRAFO-2653       TO COD-PARRAFO-ERR-QPIPCCAB  23.05.25
002053         MOVE LIT-DB2                TO COD-ACCESO-ERR-QPIPCCAB   23.05.25
002054         MOVE SQLCODE                TO QNU-SQLCODE-ERR-QPIPCCAB  23.05.25
002055                                                                  23.05.25
002056         PERFORM 9999-ERROR-GENERAL                               23.05.25
002034     END-IF                                                       23.05.25
002076     .                                                            23.05.25
002077                                                                  23.05.25
002078******************************************************************23.05.25
002079* 2654-PROCESO-CURSOR-ZFX                                        *23.05.25
002080******************************************************************23.05.25
002081 2654-PROCESO-CURSOR-ZFX.                                         23.05.25
002082                                                                  23.05.25
002077*     DISPLAY '2654-PROCESO-CURSOR-ZFX'                           23.05.25
002078     PERFORM 2655-FETCH-CURSOR-ZFX                                23.05.25
002079                                                                  23.05.25
002080     IF NO-FIN-CURSOR-ZFX                                         23.05.25
002080        PERFORM 2655-OBTENER-DATOS-ACX                            23.05.25
002144                                                                  23.05.25
002145     END-IF                                                       23.05.25
002146     .                                                            23.05.25
002147                                                                  23.05.25
002148***************************************************************   23.05.25
002149 2655-FETCH-CURSOR-ZFX.                                           23.05.25
002150***************************************************************   23.05.25
002151*     DISPLAY '2655-FETCH-CURSOR-ZFX'                             23.06.05
002152     EXEC SQL                                                     23.05.25
002153         FETCH CURSOR-ZFX                                         23.05.25
002154         INTO                                                     23.05.25
002155               :ZFX-COD-SUPLEMEN                                  23.05.25
002158     END-EXEC                                                     23.05.25
002159                                                                  23.05.25
002160     MOVE SQLCODE TO CO-SQLCODE                                   23.05.25
002161                                                                  23.05.25
002162     IF SQLCODE NOT EQUAL TO ZERO                                 23.05.25
002163        IF SQLCODE EQUAL TO CTE-SQL-100                           23.05.25
002164           SET FIN-CURSOR-ZFX TO TRUE                             23.05.25
002165        ELSE                                                      23.05.25
002166           INITIALIZE CRT2-CDSPCRT2                               23.05.25
002167*                                                                 23.05.25
002168           MOVE LIT-E                TO CRT2-COD-TIPO-ERROR       23.05.25
002169           MOVE LIT-PROGRAMA         TO CRT2-COD-PROG-ERR         23.05.25
002170           MOVE LIT-PARRAFO-2655     TO CRT2-COD-PARR-ERR         23.05.25
002171           MOVE LIT-PARRAFO-2655     TO CRT2-DES-ERROR            23.05.25
002172           MOVE LIT-TDSPCZFX         TO CRT2-COD-TABL-ERR         23.05.25
002173           MOVE CO-SQLCODE           TO CRT2-COD-SQLCODE          23.05.25
002174           MOVE CAX-COD-BANCO        TO CRT2-COD-BANCO            23.05.25
002175           MOVE CAX-COD-POLIZPSC     TO CRT2-COD-POLIZPSC         23.05.25
002176                                                                  23.05.25
002177           PERFORM 6300-GRABAR-ERROR                              23.05.25
002178                                                                  23.05.25
002179           MOVE CTE-E                TO XTI-AVIERROR-QPIPCCAB     23.05.25
002180           MOVE LIT-PROGRAMA         TO COD-MODULO-ERR-QPIPCCAB   23.05.25
002181           MOVE LIT-TDSPCZFX         TO COD-TABLA-ERR-QPIPCCAB    23.05.25
002182           MOVE LIT-PARRAFO-2655     TO COD-PARRAFO-ERR-QPIPCCAB  23.05.25
002183           MOVE LIT-DB2              TO COD-ACCESO-ERR-QPIPCCAB   23.05.25
002184           MOVE SQLCODE              TO QNU-SQLCODE-ERR-QPIPCCAB  23.05.25
002185                                                                  23.05.25
002186           PERFORM 9999-ERROR-GENERAL                             23.05.25
002187        END-IF                                                    23.05.25
002188     END-IF                                                       23.05.25
002189     .                                                            23.06.05
002193                                                                  23.05.25
002191******************************************************************23.05.25
002192* 2655-OBTENER-DATOS-ACX                                        * 23.05.25
002005******************************************************************23.05.25
002006 2655-OBTENER-DATOS-ACX.                                          23.05.25
002007                                                                  23.05.25
002008*     DISPLAY '2655-OBTENER-DATOS-ACX'                            23.06.05
002009                                                                  23.05.25
002010     INITIALIZE  DCLTDSPCACX                                      23.05.25
002011*                                                                 23.05.25
002012     MOVE CAX-COD-BANCO               TO ACX-COD-BANCO            23.05.25
002013     MOVE CAX-COD-POLIZPSC            TO ACX-COD-POLIZPSC         23.05.25
002014     MOVE ZFX-COD-SUPLEMEN            TO ACX-COD-SUPLEMEN         23.05.25
002015                                                                  23.06.05
002020     MOVE CTR1-FEC-EFECTO             TO VAR-FEC-FECHA-AIS        23.05.25
002021     MOVE VAR-FEC-ANHO2               TO VAR-FEC-ANHO             23.05.25
002022     MOVE VAR-FEC-MES2                TO VAR-FEC-MES              23.05.25
002023     MOVE VAR-FEC-DIA2                TO VAR-FEC-DIA              23.05.25
002024     MOVE VAR-FEC-FECHA               TO ACX-FEC-EFECTO           23.05.25
002025                                                                  23.06.05
002004     MOVE CTN-0                       TO ACX-COD-COLECTPC         23.05.25
002005     MOVE CTN-0                       TO ACX-COD-CERTIPSC         23.05.25
002006     MOVE CTN-0                       TO ACX-COD-ORDENGAR         23.05.25
002007     MOVE CTN-0                       TO ACX-COD-PRESTAPC         23.05.25
002008     MOVE FAX-XTI-PRIMAPSC            TO ACX-XTI-PRIMAPSC         23.05.25
002009                                                                  23.06.05
002011*     DISPLAY 'ACX-COD-BANCO: ' ACX-COD-BANCO                     23.05.25
002012*     DISPLAY 'ACX-COD-POLIZPSC: ' ACX-COD-POLIZPSC               23.05.25
002013*     DISPLAY 'ACX-COD-SUPLEMEN: ' ACX-COD-SUPLEMEN               23.05.25
002014*     DISPLAY 'ACX-FEC-EFECTO: ' ACX-FEC-EFECTO                   23.05.25
002015*     DISPLAY 'ACX-COD-COLECTPC: ' ACX-COD-COLECTPC               23.06.05
002016*     DISPLAY 'ACX-COD-CERTIPSC: ' ACX-COD-CERTIPSC               23.06.05
002017*     DISPLAY 'ACX-COD-ORDENGAR: ' ACX-COD-ORDENGAR               23.06.05
002018*     DISPLAY 'ACX-COD-PRESTAPC: ' ACX-COD-PRESTAPC               23.06.05
002019*     DISPLAY 'ACX-XTI-PRIMAPSC: ' ACX-XTI-PRIMAPSC               23.05.25
002020                                                                  23.05.25
002021*L-0003-INI                                                       23.05.25
002022*     EXEC SQL                                                    23.05.25
002023*         SELECT                                                  23.05.25
002024*                IMP_PRIMTOPC,                                    23.05.25
002025*                IMP_PRIMAPUR,                                    23.05.25
002026*                IMP_PRIMATAR,                                    23.05.25
002003*                IMP_GASINT,                                      23.05.24
002003*                IMP_GASEXT,                                      23.05.16
002004*                IMP_CONSORPC,                                    23.05.16
002005*                IMP_CLEAPSC,                                     23.05.16
002006*                IMP_IPSPSC                                       23.05.16
002007*         INTO                                                    23.05.16
002008*                :ACX-IMP-PRIMTOPC,                               23.05.16
002009*                :ACX-IMP-PRIMAPUR,                               23.05.16
002010*                :ACX-IMP-PRIMATAR,                               23.05.16
002011*                :ACX-IMP-GASINT,                                 23.05.16
002012*                :ACX-IMP-GASEXT,                                 23.05.16
002013*                :ACX-IMP-CONSORPC,                               23.05.16
002014*                :ACX-IMP-CLEAPSC,                                23.05.16
002015*                :ACX-IMP-IPSPSC                                  23.05.16
002016*         FROM TDSPCACX                                           23.05.16
002017*         WHERE                                                   23.05.16
002018*               COD_BANCO      =  :ACX-COD-BANCO     AND          23.05.16
002019*               COD_POLIZPSC   =  :ACX-COD-POLIZPSC  AND          23.05.16
002020*               COD_SUPLEMEN   =  :ACX-COD-SUPLEMEN  AND          23.05.16
002021*               FEC_EFECTO     =  :ACX-FEC-EFECTO    AND          23.05.16
002022*               COD_COLECTPC   <> :ACX-COD-COLECTPC  AND          23.05.16
002023*               COD_CERTIPSC   =  :ACX-COD-CERTIPSC  AND          23.05.16
002024*               COD_ORDENGAR   =  :ACX-COD-ORDENGAR  AND          23.05.16
002025*               COD_PRESTAPC   =  :ACX-COD-PRESTAPC  AND          23.05.16
002026*               XTI_PRIMAPSC   =  :ACX-XTI-PRIMAPSC               23.05.16
002027*     END-EXEC                                                    23.05.16
002028                                                                  23.05.16
002029     EXEC SQL                                                     23.05.16
002030         SELECT                                                   23.05.16
002031                IMP_PRIMTOPC,                                     23.05.16
002032                IMP_PRIMAPUR,                                     23.05.16
002033                IMP_PRIMATAR,                                     23.05.16
002034                IMP_GASINT,                                       23.05.16
002035                IMP_GASEXT,                                       23.05.16
002036                IMP_CONSORPC,                                     23.05.16
002037                IMP_CLEAPSC,                                      23.05.16
002038                IMP_IPSPSC                                        23.05.16
002039         INTO                                                     23.05.16
002040                :ACX-IMP-PRIMTOPC,                                23.05.16
002041                :ACX-IMP-PRIMAPUR,                                23.05.16
002042                :ACX-IMP-PRIMATAR,                                23.05.16
002043                :ACX-IMP-GASINT,                                  23.05.16
002044                :ACX-IMP-GASEXT,                                  23.05.16
002045                :ACX-IMP-CONSORPC,                                23.05.16
002046                :ACX-IMP-CLEAPSC,                                 23.05.16
002047                :ACX-IMP-IPSPSC                                   23.05.16
002048         FROM TDSPCACX                                            23.05.16
002049         WHERE                                                    23.05.16
002050               COD_BANCO      =  :ACX-COD-BANCO     AND           23.05.16
002051               COD_POLIZPSC   =  :ACX-COD-POLIZPSC  AND           23.05.16
002052               COD_SUPLEMEN   =  :ACX-COD-SUPLEMEN  AND           23.05.16
002053               FEC_EFECTO     =  :ACX-FEC-EFECTO    AND           23.05.16
002054               COD_COLECTPC   =  :ACX-COD-COLECTPC  AND           23.05.16
002055               COD_CERTIPSC   =  :ACX-COD-CERTIPSC  AND           23.05.16
002056               COD_ORDENGAR   =  :ACX-COD-ORDENGAR  AND           23.05.16
002057               COD_PRESTAPC   =  :ACX-COD-PRESTAPC  AND           23.05.16
002058               XTI_PRIMAPSC   =  :ACX-XTI-PRIMAPSC                23.05.16
002059     END-EXEC                                                     23.05.16
002060*L-0003-FIN                                                       23.05.16
002061                                                                  23.05.16
002062     MOVE SQLCODE TO CO-SQLCODE                                   23.05.16
002063                                                                  23.05.16
002064     EVALUATE SQLCODE                                             23.05.16
002065       WHEN ZEROS                                                 23.05.16
002066          CONTINUE                                                23.05.16
002067       WHEN CTE-100                                               23.05.16
002068                                                                  23.05.16
002069            MOVE LIT-2655           TO CRT2-COD-PARR-ERR          23.05.16
002070            MOVE LIT-CONSULTA-ACX   TO CRT2-DES-ERROR             23.05.16
002071            MOVE CO-SQLCODE         TO CRT2-COD-ERROR             23.05.16
002072            MOVE LIT-E              TO CRT2-COD-TIPO-ERROR        23.05.16
002073            MOVE LIT-PROGRAMA       TO CRT2-COD-PROG-ERR          23.05.16
002074                                                                  23.05.16
002075            MOVE CAX-COD-BANCO      TO CRT2-COD-BANCO             23.05.16
002076            MOVE CAX-COD-POLIZPSC   TO CRT2-COD-POLIZPSC          23.05.16
002077                                                                  23.05.16
002078            PERFORM 6300-GRABAR-ERROR                             23.05.16
002079                                                                  23.05.16
002080            SET SI-ERROR-GRAVE      TO TRUE                       23.05.16
002081                                                                  23.05.16
002082       WHEN OTHER                                                 23.05.16
002083                                                                  23.05.16
002084            MOVE LIT-2655           TO CRT2-COD-PARR-ERR          23.05.16
002085            MOVE LIT-CONSULTA-ACX   TO CRT2-DES-ERROR             23.05.16
002086            MOVE CO-SQLCODE         TO CRT2-COD-ERROR             23.05.16
002087            MOVE LIT-E              TO CRT2-COD-TIPO-ERROR        23.05.16
002088            MOVE LIT-PROGRAMA       TO CRT2-COD-PROG-ERR          23.05.16
002089                                                                  23.05.16
002090            MOVE CAX-COD-BANCO      TO CRT2-COD-BANCO             23.05.16
002091            MOVE CAX-COD-POLIZPSC   TO CRT2-COD-POLIZPSC          23.05.16
002092                                                                  23.05.16
002093            PERFORM 6300-GRABAR-ERROR                             23.05.16
002094                                                                  23.05.16
002095            MOVE LIT-E              TO XTI-AVIERROR-QPIPCCAB      23.05.16
002096            MOVE LIT-PROGRAMA       TO COD-MODULO-ERR-QPIPCCAB    23.05.16
002097            MOVE LIT-TDSPCACX       TO COD-TABLA-ERR-QPIPCCAB     23.05.16
002098            MOVE LIT-2655           TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
002099            MOVE LIT-DB2            TO COD-ACCESO-ERR-QPIPCCAB    23.05.16
002100            MOVE SQLCODE            TO QNU-SQLCODE-ERR-QPIPCCAB   23.05.16
002101                                                                  23.05.16
002102            PERFORM 9999-ERROR-GENERAL                            23.05.16
002103                                                                  23.05.16
002104     END-EVALUATE                                                 23.05.25
002105                                                                  23.05.25
002106     COMPUTE WS-PRIMA-TOTAL-ACX ROUNDED =                         23.05.26
002127     WS-PRIMA-TOTAL-ACX + ACX-IMP-PRIMTOPC                        23.05.26
002128     MOVE WS-PRIMA-TOTAL-ACX       TO CTRE-PRIMA-TOTAL            23.05.26
002128                                                                  23.05.25
002129     COMPUTE WS-PRIMA-NETA-ACX ROUNDED =                          23.05.26
002130     WS-PRIMA-NETA-ACX + ACX-IMP-PRIMATAR                         23.05.26
002131     MOVE WS-PRIMA-NETA-ACX        TO CTRE-PRIMA-NETA             23.05.26
002132     DISPLAY 'WS-PRIMA-NETA-ACX: ' WS-PRIMA-NETA-ACX              23.05.26
002133     DISPLAY 'CAX-COD-POLIZPSC: ' CAX-COD-POLIZPSC                23.05.25
002133     DISPLAY 'CTRE-PRIMA-NETA: ' CTRE-PRIMA-NETA                  23.05.25
002132                                                                  23.05.26
002133     COMPUTE WS-PRIMAPUR-ACX ROUNDED =                            23.05.26
002134     WS-PRIMAPUR-ACX + ACX-IMP-PRIMAPUR                           23.05.26
002135                                                                  23.05.26
002132     COMPUTE WS-CCS-IMPORTE-ACX ROUNDED =                         23.05.26
002133     WS-CCS-IMPORTE-ACX + ACX-IMP-CONSORPC                        23.05.26
002134     MOVE WS-CCS-IMPORTE-ACX       TO CTRE-CCS-IMPORTE            23.05.26
002134                                                                  23.05.25
002135     COMPUTE WS-CLEA-IMPORTE-ACX ROUNDED =                        23.05.26
002136     WS-CLEA-IMPORTE-ACX + ACX-IMP-CLEAPSC                        23.05.26
002137     MOVE WS-CLEA-IMPORTE-ACX      TO CTRE-CLEA-IMPORTE           23.05.26
002137                                                                  23.05.25
002138     COMPUTE WS-IPS-IMPORTE-ACX ROUNDED =                         23.05.26
002139     WS-IPS-IMPORTE-ACX + ACX-IMP-IPSPSC                          23.05.26
002140     MOVE WS-IPS-IMPORTE-ACX       TO CTRE-IPS-IMPORTE            23.05.26
002140                                                                  23.05.25
002141     COMPUTE WS-CPN-IMPORTE-ACX ROUNDED =                         23.05.26
002142     WS-CPN-IMPORTE-ACX + ACX-IMP-GASEXT                          23.05.26
002143     MOVE WS-CPN-IMPORTE-ACX       TO CTRE-CPN-IMPORTE            23.05.26
002143                                                                  23.05.25
002144     COMPUTE WS-GASINT-TOT ROUNDED =                              23.05.25
002145     WS-GASINT-TOT + ACX-IMP-GASINT                               23.05.25
002146                                                                  23.05.25
002147     COMPUTE WS-GASINT-COA ROUNDED                                23.05.25
002148     = WS-GASINT-TOT - FAX-IMP-GASINT                             23.05.25
002149*           DISPLAY 'WS-GASINT-TOT: ' WS-GASINT-TOT               23.05.25
002150           DISPLAY 'WS-PRIMA-TOTAL-ACX : ' WS-PRIMA-TOTAL-ACX     23.06.05
002151*           DISPLAY 'WS-PRIMA-NETA-ACX: ' WS-PRIMA-NETA-ACX       23.06.05
002152*           DISPLAY 'WS-CCS-IMPORTE-ACX: ' WS-CCS-IMPORTE-ACX     23.06.05
002153*           DISPLAY 'WS-CLEA-IMPORTE-ACX: ' WS-CLEA-IMPORTE-ACX   23.06.05
002154*           DISPLAY 'WS-IPS-IMPORTE-ACX: ' WS-IPS-IMPORTE-ACX     23.06.05
002155*           DISPLAY 'WS-CPN-IMPORTE-ACX: ' WS-CPN-IMPORTE-ACX     23.06.05
002156*           DISPLAY 'WS-GASINT-TOT: ' WS-GASINT-TOT               23.06.05
002157                                                                  23.05.25
002158                                                                  23.05.25
002159*           DISPLAY 'CTRE-PRIMA-TOTAL: ' CTRE-PRIMA-TOTAL         23.06.05
002160*           DISPLAY 'CTRE-PRIMA-NETA: ' CTRE-PRIMA-NETA           23.06.05
002161*           DISPLAY 'CTRE-CCS-IMPORTE: ' CTRE-CCS-IMPORTE         23.06.05
002162*           DISPLAY 'CTRE-CLEA-IMPORTE: ' CTRE-CLEA-IMPORTE       23.06.05
002163*           DISPLAY 'CTRE-IPS-IMPORTE: ' CTRE-IPS-IMPORTE         23.06.05
002164*           DISPLAY 'CTRE-CPN-IMPORTE: ' CTRE-CPN-IMPORTE         23.06.05
002165     .                                                            23.05.25
002106                                                                  23.05.25
002107***************************************************************   23.05.25
002108 2657-CERRAR-CURSOR-ZFX.                                          23.05.25
002109***************************************************************   23.05.25
002110                                                                  23.05.25
002111     EXEC SQL                                                     23.05.25
002112         CLOSE CURSOR-ZFX                                         23.05.25
002113     END-EXEC                                                     23.05.25
002114                                                                  23.05.25
002115     MOVE SQLCODE TO CO-SQLCODE                                   23.05.25
002116                                                                  23.05.25
002117     IF SQLCODE NOT EQUAL TO ZERO                                 23.05.25
002118         INITIALIZE CRT2-CDSPCRT2                                 23.05.25
002119*                                                                 23.05.25
002120         MOVE LIT-E                  TO CRT2-COD-TIPO-ERROR       23.05.25
002121         MOVE LIT-PROGRAMA           TO CRT2-COD-PROG-ERR         23.05.25
002122         MOVE LIT-PARRAFO-2657       TO CRT2-COD-PARR-ERR         23.05.25
002123         MOVE LIT-PARRAFO-2657       TO CRT2-DES-ERROR            23.05.25
002124         MOVE LIT-TDSPCZFX           TO CRT2-COD-TABL-ERR         23.05.25
002125         MOVE CO-SQLCODE             TO CRT2-COD-SQLCODE          23.05.25
002126*                                                                 23.05.25
002127         MOVE CAX-COD-BANCO         TO CRT2-COD-BANCO             23.05.25
002128         MOVE CAX-COD-POLIZPSC      TO CRT2-COD-POLIZPSC          23.05.25
002129*                                                                 23.05.25
002130         PERFORM 6300-GRABAR-ERROR                                23.05.25
002131*                                                                 23.05.25
002132         MOVE CTE-E                  TO XTI-AVIERROR-QPIPCCAB     23.05.25
002133         MOVE LIT-PROGRAMA           TO COD-MODULO-ERR-QPIPCCAB   23.05.25
002134         MOVE LIT-TDSPCZFX           TO COD-TABLA-ERR-QPIPCCAB    23.05.25
002135         MOVE LIT-PARRAFO-2657       TO COD-PARRAFO-ERR-QPIPCCAB  23.05.25
002136         MOVE LIT-DB2                TO COD-ACCESO-ERR-QPIPCCAB   23.05.25
002137         MOVE SQLCODE                TO QNU-SQLCODE-ERR-QPIPCCAB  23.05.25
002138                                                                  23.05.25
002139         PERFORM 9999-ERROR-GENERAL                               23.05.25
002140     END-IF.                                                      23.05.25
002141*                                                                 23.05.25
002107******************************************************************23.05.16
002108* 6100-GRABAR-SALIDA1                                            *23.05.16
002109* SE GRABA EL REGISTRO DE SALIDA DE RECIBO                       *23.05.16
002110******************************************************************23.05.16
002111 6100-GRABAR-SALIDA1.                                             23.05.16
002112                                                                  23.05.16
002113*     DISPLAY '6100-GRABAR-SALIDA1'                               23.05.16
002114*L-0001-INI                                                       23.05.25
002115     INITIALIZE WS-LINEA-RECIBOS                                  23.06.05
002116                                                                  23.05.16
002117     STRING CTRE-TIPO-REGISTRO         DELIMITED BY LIT-ESPACIO   23.05.16
002118            LIT-5E                     DELIMITED BY SIZE          23.05.16
002119            CTRE-TIPO-MOVIMIENTO       DELIMITED BY LIT-ESPACIO   23.05.16
002120            LIT-5E                     DELIMITED BY SIZE          23.05.16
002121            CTRE-FECHA                 DELIMITED BY LIT-ESPACIO   23.05.16
002122            LIT-5E                     DELIMITED BY SIZE          23.05.16
002123            CTRE-ENT-ABRIDORA          DELIMITED BY LIT-ESPACIO   23.05.16
002124            LIT-5E                     DELIMITED BY SIZE          23.05.16
002125            CTRE-PARTICIP-ABRIDORA     DELIMITED BY SIZE          23.05.16
002126            LIT-5E                     DELIMITED BY SIZE          23.05.16
002127            CTRE-COD-POLIZA            DELIMITED BY LIT-ESPACIO   23.05.16
002128            LIT-5E                     DELIMITED BY SIZE          23.05.16
002129            CTRE-COD-SUPLEMENTO        DELIMITED BY LIT-ESPACIO   23.05.16
002130            LIT-5E                     DELIMITED BY SIZE          23.05.16
002131            CTRE-ID-APLICACION         DELIMITED BY LIT-ESPACIO   23.05.16
002132            LIT-5E                     DELIMITED BY SIZE          23.05.16
002133            CTRE-ENT-ACEPTANTE         DELIMITED BY LIT-ESPACIO   23.05.16
002134            LIT-5E                     DELIMITED BY SIZE          23.05.16
002135            CTRE-PARTICIP-ACEPTANTE    DELIMITED BY LIT-ESPACIO   23.05.16
002136            LIT-5E                     DELIMITED BY SIZE          23.05.16
002137            CTRE-POLIZA-ACEPTANTE      DELIMITED BY LIT-ESPACIO   23.05.16
002138            LIT-5E                     DELIMITED BY SIZE          23.05.16
002139            CTRE-RAMO                  DELIMITED BY LIT-ESPACIO   23.05.16
002140            LIT-5E                     DELIMITED BY SIZE          23.05.16
002141            CTRE-SUBRAMO               DELIMITED BY LIT-ESPACIO   23.05.16
002142            LIT-5E                     DELIMITED BY SIZE          23.05.16
002143            CTRE-TIPOEMISION           DELIMITED BY LIT-ESPACIO   23.05.16
002144            LIT-5E                     DELIMITED BY SIZE          23.05.16
002145            CTRE-NUMERO-RECIBO         DELIMITED BY LIT-ESPACIO   23.05.16
002146            LIT-5E                     DELIMITED BY SIZE          23.05.16
002147            CTRE-CLASE-RECIBO          DELIMITED BY LIT-ESPACIO   23.05.16
002148            LIT-5E                     DELIMITED BY SIZE          23.05.16
002149            CTRE-SOPORTE-RECIBO        DELIMITED BY LIT-ESPACIO   23.05.16
002150            LIT-5E                     DELIMITED BY SIZE          23.05.16
002151            CTRE-IBAN                  DELIMITED BY LIT-ESPACIO   23.05.16
002152            LIT-5E                     DELIMITED BY SIZE          23.05.16
002153            CTRE-FECHA-EMISION         DELIMITED BY LIT-ESPACIO   23.05.16
002154            LIT-5E                     DELIMITED BY SIZE          23.05.16
002155            CTRE-FECHA-EFECTO          DELIMITED BY LIT-ESPACIO   23.05.16
002156            LIT-5E                     DELIMITED BY SIZE          23.05.16
002157            CTRE-FECHA-VENCIMIENTO     DELIMITED BY LIT-ESPACIO   23.05.16
002158            LIT-5E                     DELIMITED BY SIZE          23.05.16
002159            CTRE-HACIENDA-TRIBUTARIA   DELIMITED BY LIT-ESPACIO   23.05.16
002160            LIT-5E                     DELIMITED BY SIZE          23.05.16
002161            CTRE-MONEDA                DELIMITED BY LIT-ESPACIO   23.05.16
002162            LIT-5E                     DELIMITED BY SIZE          23.05.16
002163            CTRE-PRIMA-TOTAL           DELIMITED BY SIZE          23.05.16
002164            LIT-5E                     DELIMITED BY SIZE          23.05.16
002165            CTRE-PRIMA-NETA            DELIMITED BY SIZE          23.05.16
002166            LIT-5E                     DELIMITED BY SIZE          23.05.16
002167            CTRE-PB                    DELIMITED BY LIT-ESPACIO   23.05.16
002168            LIT-5E                     DELIMITED BY SIZE          23.05.16
002169            CTRE-RECARGO-PAFRACCIONADO DELIMITED BY LIT-ESPACIO   23.05.16
002170            LIT-5E                     DELIMITED BY SIZE          23.05.16
002171            CTRE-LIQUIDO               DELIMITED BY SIZE          23.05.16
002172            LIT-5E                     DELIMITED BY SIZE          23.05.16
002173            CTRE-GASTOS-ADMIN          DELIMITED BY SIZE          23.05.16
002174            LIT-5E                     DELIMITED BY SIZE          23.05.16
002175            CTRE-IVA-GASTOS-ADMIN      DELIMITED BY SIZE          23.05.16
002176            LIT-5E                     DELIMITED BY SIZE          23.05.16
002177            CTRE-CPN-PORCENTAJE        DELIMITED BY LIT-ESPACIO   23.05.16
002178            LIT-5E                     DELIMITED BY SIZE          23.05.16
002179            CTRE-CPN-IMPORTE           DELIMITED BY SIZE          23.05.16
002180            LIT-5E                     DELIMITED BY SIZE          23.05.16
002181            CTRE-CCS-PORCENTAJE        DELIMITED BY LIT-ESPACIO   23.05.16
002182            LIT-5E                     DELIMITED BY SIZE          23.05.16
002183            CTRE-CCS-IMPORTE           DELIMITED BY SIZE          23.05.16
002184            LIT-5E                     DELIMITED BY SIZE          23.05.16
002185            CTRE-OTRAS-PORCENTAJE      DELIMITED BY LIT-ESPACIO   23.05.16
002186            LIT-5E                     DELIMITED BY SIZE          23.05.16
002187            CTRE-OTRAS-IMPORTE         DELIMITED BY LIT-ESPACIO   23.05.16
002188            LIT-5E                     DELIMITED BY SIZE          23.05.16
002189            CTRE-CLEA-PORCENTAJE       DELIMITED BY LIT-ESPACIO   23.05.16
002190            LIT-5E                     DELIMITED BY SIZE          23.05.16
002191            CTRE-CLEA-IMPORTE          DELIMITED BY SIZE          23.05.16
002192            LIT-5E                     DELIMITED BY SIZE          23.05.16
002193            CTRE-IPS-PORCENTAJE        DELIMITED BY LIT-ESPACIO   23.05.16
002194            LIT-5E                     DELIMITED BY SIZE          23.05.16
002195            CTRE-IPS-IMPORTE           DELIMITED BY SIZE          23.05.16
002196            LIT-5E                     DELIMITED BY SIZE          23.05.16
002197            CTRE-CCSRE-PORCENTAJE      DELIMITED BY LIT-ESPACIO   23.05.16
002198            LIT-5E                     DELIMITED BY SIZE          23.05.16
002199            CTRE-CCSRE-IMPORTE         DELIMITED BY LIT-ESPACIO   23.05.16
002200            LIT-5E                     DELIMITED BY SIZE          23.05.16
002201            CTRE-BAJASIN-PORCENTAJE    DELIMITED BY LIT-ESPACIO   23.05.16
002202            LIT-5E                     DELIMITED BY SIZE          23.05.16
002203            CTRE-BAJASIN-IMPORTE       DELIMITED BY LIT-ESPACIO   23.05.16
002204            LIT-5E                     DELIMITED BY SIZE          23.05.16
002205            CTRE-COMERCIAL-PORCENTAJE  DELIMITED BY LIT-ESPACIO   23.05.16
002206            LIT-5E                     DELIMITED BY SIZE          23.05.16
002207            CTRE-COMERCIAL-IMPORTE     DELIMITED BY LIT-ESPACIO   23.05.16
002208            LIT-5E                     DELIMITED BY SIZE          23.05.16
002209            CTRE-COD-RESULTADO         DELIMITED BY LIT-ESPACIO   23.05.16
002210            LIT-5E                     DELIMITED BY SIZE          23.05.16
002211            CTRE-DESC-RESULTADO        DELIMITED BY LIT-ESPACIO   23.05.16
002212            LIT-5E                     DELIMITED BY SIZE          23.05.16
002213       INTO WS-LINEA-RECIBOS                                      23.05.16
002214     END-STRING                                                   23.05.16
002215                                                                  23.05.16
002216*    WRITE REG-FPCRECS1 FROM CDSPCTRE-REG-RECIBOS                 23.05.16
002217     WRITE REG-FPCRECS1 FROM WS-LINEA-RECIBOS                     23.05.16
002218*L-0001-FIN                                                       23.05.16
002219     MOVE LIT-6100                   TO CRT2-COD-PARR-ERR         23.05.16
002220     MOVE LIT-ERROR-ESCRITURA1       TO CRT2-DES-ERROR            23.05.16
002221                                                                  23.05.16
002222     MOVE LIT-WRITE                  TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
002223     STRING LIT-ERROR-ESCRITURA1 LIT-FS FS-FPCRECE1               23.05.16
002224     DELIMITED BY SIZE                                            23.05.16
002225     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
002226                                                                  23.05.16
002227     PERFORM 9300-CHECK-FS-SALIDA1                                23.05.16
002228                                                                  23.05.16
002229     ADD CTE-SUMA-1                  TO CONT-GRABADOS1            23.05.16
002230     .                                                            23.05.16
002231                                                                  23.05.16
002232******************************************************************23.05.16
002233* 6200-GRABAR-SALIDA1                                            *23.05.16
002234* SE GRABA EL REGISTRO DE SALIDA DE RECIBO-CESION                *23.05.16
002235******************************************************************23.05.16
002236 6200-GRABAR-SALIDA1.                                             23.05.16
002237                                                                  23.05.16
002238*     DISPLAY '6200-GRABAR-SALIDA1'                               23.05.16
002239                                                                  23.05.16
002240*L-0001-INI                                                       23.05.16
002241     INITIALIZE WS-LINEA-RECIBO-CESION                            23.05.16
002242                                                                  23.05.16
002243     STRING CTRE-TIPO-REGISTRO-C         DELIMITED BY LIT-ESPACIO 23.05.16
002244            LIT-5E                       DELIMITED BY SIZE        23.05.16
002245            CTRE-ENT-ACEPTANTE-C         DELIMITED BY LIT-ESPACIO 23.05.16
002246            LIT-5E                       DELIMITED BY SIZE        23.05.16
002247            CTRE-NUMERO-RECACE-C         DELIMITED BY LIT-ESPACIO 23.05.16
002248            LIT-5E                       DELIMITED BY SIZE        23.05.16
002249            CTRE-PRIMA-TOTAL-C           DELIMITED BY SIZE        23.05.16
002250            LIT-5E                       DELIMITED BY SIZE        23.05.16
002251            CTRE-PRIMA-NETA-C            DELIMITED BY SIZE        23.05.16
002252            LIT-5E                       DELIMITED BY SIZE        23.05.16
002253            CTRE-PB-C                    DELIMITED BY LIT-ESPACIO 23.05.16
002254            LIT-5E                       DELIMITED BY SIZE        23.05.16
002255            CTRE-RECARGO-PAFRACCIONADO-C DELIMITED BY LIT-ESPACIO 23.05.16
002256            LIT-5E                       DELIMITED BY SIZE        23.05.16
002257            CTRE-LIQUIDO-C               DELIMITED BY SIZE        23.05.16
002258            LIT-5E                       DELIMITED BY SIZE        23.05.16
002259            CTRE-GASTOS-ADMIN-C          DELIMITED BY SIZE        23.05.16
002260            LIT-5E                       DELIMITED BY SIZE        23.05.16
002261            CTRE-IVA-GASTOS-ADMIN-C      DELIMITED BY SIZE        23.05.16
002262            LIT-5E                       DELIMITED BY SIZE        23.05.16
002263            CTRE-CPN-PORCENTAJE-C        DELIMITED BY LIT-ESPACIO 23.05.16
002264            LIT-5E                       DELIMITED BY SIZE        23.05.16
002265            CTRE-CPN-IMPORTE-C           DELIMITED BY SIZE        23.05.16
002266            LIT-5E                       DELIMITED BY SIZE        23.05.16
002267            CTRE-CCS-PORCENTAJE-C        DELIMITED BY LIT-ESPACIO 23.05.16
002268            LIT-5E                       DELIMITED BY SIZE        23.05.16
002269            CTRE-CCS-IMPORTE-C           DELIMITED BY SIZE        23.05.16
002270            LIT-5E                       DELIMITED BY SIZE        23.05.16
002271            CTRE-OTRAS-PORCENTAJE-C      DELIMITED BY LIT-ESPACIO 23.05.16
002272            LIT-5E                       DELIMITED BY SIZE        23.05.16
002273            CTRE-OTRAS-IMPORTE-C         DELIMITED BY LIT-ESPACIO 23.05.16
002274            LIT-5E                       DELIMITED BY SIZE        23.05.16
002275            CTRE-CLEA-PORCENTAJE-C       DELIMITED BY LIT-ESPACIO 23.05.16
002276            LIT-5E                       DELIMITED BY SIZE        23.05.16
002277            CTRE-CLEA-IMPORTE-C          DELIMITED BY SIZE        23.05.16
002278            LIT-5E                       DELIMITED BY SIZE        23.05.16
002279            CTRE-IPS-PORCENTAJE-C        DELIMITED BY LIT-ESPACIO 23.05.16
002280            LIT-5E                       DELIMITED BY SIZE        23.05.16
002281            CTRE-IPS-IMPORTE-C           DELIMITED BY SIZE        23.05.16
002282            LIT-5E                       DELIMITED BY SIZE        23.05.16
002283            CTRE-CCSRE-PORCENTAJE-C      DELIMITED BY LIT-ESPACIO 23.05.16
002284            LIT-5E                       DELIMITED BY SIZE        23.05.16
002285            CTRE-CCSRE-IMPORTE-C         DELIMITED BY LIT-ESPACIO 23.05.16
002286            LIT-5E                       DELIMITED BY SIZE        23.05.16
002287            CTRE-BAJASIN-PORCENTAJE-C    DELIMITED BY LIT-ESPACIO 23.05.16
002288            LIT-5E                       DELIMITED BY SIZE        23.05.16
002289            CTRE-BAJASIN-IMPORTE-C       DELIMITED BY LIT-ESPACIO 23.05.16
002290            LIT-5E                       DELIMITED BY SIZE        23.05.16
002291            CTRE-COMERCIAL-PORCENTAJE-C  DELIMITED BY LIT-ESPACIO 23.05.16
002292            LIT-5E                       DELIMITED BY SIZE        23.05.16
002293            CTRE-COMERCIAL-IMPORTE-C     DELIMITED BY LIT-ESPACIO 23.05.16
002294            LIT-5E                       DELIMITED BY SIZE        23.05.16
002295       INTO WS-LINEA-RECIBO-CESION                                23.05.16
002296     END-STRING                                                   23.05.16
002297                                                                  23.05.16
002298*    WRITE REG-FPCRECS1 FROM CDSPCTRE-REG-RECIBO-CESION           23.05.16
002299     WRITE REG-FPCRECS1 FROM WS-LINEA-RECIBO-CESION               23.05.16
002300*L-0001-FIN                                                       23.05.16
002301                                                                  23.05.16
002302                                                                  23.05.16
002303     MOVE LIT-6200                   TO CRT2-COD-PARR-ERR         23.05.16
002304     MOVE LIT-ERROR-ESCRITURA1       TO CRT2-DES-ERROR            23.05.16
002305                                                                  23.05.16
002306     MOVE LIT-WRITE                  TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
002307     STRING LIT-ERROR-ESCRITURA1 LIT-FS FS-FPCRECE1               23.05.16
002308     DELIMITED BY SIZE                                            23.05.16
002309     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
002310                                                                  23.05.16
002311     PERFORM 9300-CHECK-FS-SALIDA1                                23.05.16
002312                                                                  23.05.16
002313     ADD CTE-SUMA-1                  TO CONT-GRABADOS1            23.05.16
002314     .                                                            23.05.16
002315*L-0002-INI                                                       23.05.16
002316******************************************************************23.05.16
002317* 6200-GRABAR-CABECERA                                           *23.05.16
002318* SE GRABAN LOS REGISTROS DE SALIDA, REGISTRO CABECERA           *23.05.16
002319******************************************************************23.05.16
002320 6200-GRABAR-CABECERA.                                            23.05.16
002321                                                                  23.05.16
002322*     DISPLAY '6200-GRABAR-CABECERA'                              23.06.05
002323                                                                  23.05.16
002324     INITIALIZE WS-LINEA-CABECERA                                 23.05.16
002325                                                                  23.05.16
002326     STRING WS-REGISTRO-CAB             DELIMITED BY LIT-ESPACIO  23.05.16
002327            LIT-5E                      DELIMITED BY SIZE         23.05.16
002328            WS-FECHA-CAB                DELIMITED BY LIT-ESPACIO  23.05.16
002329            LIT-5E                      DELIMITED BY SIZE         23.05.16
002330            WS-IDEMISOR-CAB             DELIMITED BY LIT-ESPACIO  23.05.16
002331            LIT-5E                      DELIMITED BY SIZE         23.05.16
002332            WS-IDPERCEPTOR-CAB          DELIMITED BY LIT-ESPACIO  23.05.16
002333            LIT-5E                      DELIMITED BY SIZE         23.05.16
002334            WS-IDFICHERO-CAB            DELIMITED BY LIT-ESPACIO  23.05.16
002335            LIT-5E                      DELIMITED BY SIZE         23.05.16
002336            WS-COD-RESUL-CAB            DELIMITED BY LIT-ESPACIO  23.05.16
002337            LIT-5E                      DELIMITED BY SIZE         23.05.16
002338            WS-DESC-RESUL-CAB           DELIMITED BY LIT-ESPACIO  23.05.16
002339            LIT-5E                      DELIMITED BY SIZE         23.05.16
002340       INTO WS-LINEA-CABECERA                                     23.05.16
002341     END-STRING                                                   23.05.16
002342                                                                  23.05.16
002343     WRITE REG-FPCRECS1 FROM WS-LINEA-CABECERA                    23.05.16
002344                                                                  23.05.16
002345     MOVE LIT-6200                   TO CRT2-COD-PARR-ERR         23.05.16
002346     MOVE LIT-ERROR-ESCRITURA1       TO CRT2-DES-ERROR            23.05.16
002347                                                                  23.05.16
002348     MOVE LIT-WRITE                  TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
002349     STRING LIT-ERROR-ESCRITURA1 LIT-FS REG-FPCRECS1              23.05.16
002350     DELIMITED BY SIZE                                            23.05.16
002351     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
002352                                                                  23.05.16
002353     PERFORM 9300-CHECK-FS-SALIDA1                                23.05.16
002354                                                                  23.05.16
002355     ADD CTE-SUMA-1                  TO CONT-GRABADOS1            23.05.16
002356     .                                                            23.05.16
002357*L-0002-FIN                                                       23.05.16
002358******************************************************************23.05.16
002359* 3000-FINAL                                                     *23.05.16
002360* SE CIERRAN LOS FICHEROS.                                       *23.05.16
002361* SE FINALIZA EL PROGRAMA.                                       *23.05.16
002362******************************************************************23.05.16
002363                                                                  23.05.16
002364 3000-FINAL.                                                      23.05.16
002365                                                                  23.05.16
002366     PERFORM 3100-CERRAR-FICHEROS                                 23.05.16
002367     PERFORM 3200-ESTADISTICAS                                    23.05.16
002368                                                                  23.05.16
002369     GOBACK.                                                      23.05.16
002370                                                                  23.05.16
002371******************************************************************23.05.16
002372* 3100-CERRAR-FICHEROS                                           *23.05.16
002373* SE CIERRAN LOS FICHEROS DE ENTRADA Y SALIDA Y SE CONTROLA EL   *23.05.16
002374* FILE-STATUS DE LOS MISMOS.                                     *23.05.16
002375******************************************************************23.05.16
002376                                                                  23.05.16
002377 3100-CERRAR-FICHEROS.                                            23.05.16
002378                                                                  23.05.16
002379     CLOSE FPCRECE1                                               23.05.16
002380           FPCRECS1                                               23.05.16
002381                                                                  23.05.16
002382     MOVE LIT-3100                   TO CRT2-COD-PARR-ERR         23.05.16
002383                                                                  23.05.16
002384     MOVE LIT-ERROR-CERRAR1          TO CRT2-DES-ERROR            23.05.16
002385                                                                  23.05.16
002386     MOVE LIT-CLOSE                  TO COD-ACCESO-ERR-QPIPCCAB   23.05.16
002387     STRING LIT-ERROR-CERRAR1 LIT-FS FS-FPCRECE1                  23.05.16
002388     DELIMITED BY SIZE                                            23.05.16
002389     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
002390                                                                  23.05.16
002391     PERFORM 9100-CHECK-FS-ENTRADA1                               23.05.16
002392                                                                  23.05.16
002393     MOVE LIT-ERROR-CERRAR3       TO CRT2-DES-ERROR               23.05.16
002394                                                                  23.05.16
002395     MOVE LIT-CLOSE               TO COD-ACCESO-ERR-QPIPCCAB      23.05.16
002396     STRING LIT-ERROR-CERRAR3 LIT-FS FS-FPCRECS1                  23.05.16
002397     DELIMITED BY SIZE                                            23.05.16
002398     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
002399                                                                  23.05.16
002400     PERFORM 9300-CHECK-FS-SALIDA1                                23.05.16
002401                                                                  23.05.16
002402     CLOSE FPCRECL1                                               23.05.16
002403                                                                  23.05.16
002404     MOVE LIT-ERROR-CERRAR4       TO CRT2-DES-ERROR               23.05.16
002405                                                                  23.05.16
002406     MOVE LIT-CLOSE               TO COD-ACCESO-ERR-QPIPCCAB      23.05.16
002407     STRING LIT-ERROR-CERRAR4 LIT-FS FS-FPCRECL1                  23.05.16
002408     DELIMITED BY SIZE                                            23.05.16
002409     INTO DES-SQLCA-ERR-QPIPCCAB                                  23.05.16
002410                                                                  23.05.16
002411     PERFORM 9400-CHECK-FS-SALIDA2                                23.05.16
002412     .                                                            23.05.16
002413                                                                  23.05.16
002414******************************************************************23.05.16
002415* 3200-ESTADISTICAS                                              *23.05.16
002416* SE INDICAN LOS DATOS DEL PROCESO REALIZADO Y EL NUMERO DE      *23.05.16
002417* DE DATOS LEIDOS Y GRABADOS                                     *23.05.16
002418******************************************************************23.05.16
002419                                                                  23.05.16
002420 3200-ESTADISTICAS.                                               23.05.16
002421                                                                  23.05.16
002422     MOVE CONT-LEIDOS1               TO VAR-LEIDOS1               23.05.16
002423     MOVE CONT-LEIDOS2               TO VAR-LEIDOS2               23.05.16
002424     MOVE CONT-GRABADOS1             TO VAR-GRABADOS1             23.05.16
002425     MOVE CONT-ERRORES               TO VAR-ERRORES               23.05.16
002426     MOVE VAR-LEIDOS1                TO VAR-LEIDOS1-ED            23.05.16
002427     MOVE VAR-LEIDOS2                TO VAR-LEIDOS2-ED            23.05.16
002428     MOVE VAR-GRABADOS1              TO VAR-GRABADOS1-ED          23.05.16
002429     MOVE VAR-ERRORES                TO VAR-ERRORES-ED            23.05.16
002430                                                                  23.05.16
002431     DISPLAY '***********************************************'    23.05.16
002432     DISPLAY '             PROGRAMA ' LIT-PROGRAMA                23.05.16
002433     DISPLAY '***********************************************'    23.05.16
002434     DISPLAY '*** REGISTROS LEIDOS.AIS         :' VAR-LEIDOS1-ED  23.05.16
002435     DISPLAY '*** GRABADOS INFORME.SALIDA      :' VAR-GRABADOS1-ED23.05.16
002436     DISPLAY '*** GRABADOS INFORME.CABECERA    :' VAR-GRABADOS2-ED23.05.16
002437     DISPLAY '*** GRABADOS ERRORES.INCIDENCIAS: ' VAR-ERRORES-ED  23.05.16
002438     DISPLAY '***********************************************'.   23.05.16
002439                                                                  23.05.16
002440                                                                  23.05.16
002441******************************************************************23.05.16
002442* 9100-CHECK-FS-ENTRADA1                                         *23.05.16
002443* SE COMPRUEBA QUE EL FILE STATUS DEL FICHERO SEA CORRECTO       *23.05.16
002444* SI NO ES ASI, SE INFORMA DEL ERROR Y SE CANCELA EL PROGRAMA.   *23.05.16
002445******************************************************************23.05.16
002446                                                                  23.05.16
002447 9100-CHECK-FS-ENTRADA1.                                          23.05.16
002448                                                                  23.05.16
002449     IF FS-FPCRECE1 NOT EQUAL LIT-FS-00                           23.05.16
002450                                                                  23.05.16
002451        MOVE FS-FPCRECE1    TO CRT2-COD-FILESTATUS                23.05.16
002452        MOVE LIT-FPCRECE1   TO CRT2-NOM-FICHERO                   23.05.16
002453                                                                  23.05.16
002454        PERFORM 9999-FIN-ERROR                                    23.05.16
002455                                                                  23.05.16
002456        MOVE FS-FPCRECE1            TO COD-AVIERROR-QPIPCCAB      23.05.16
002457        MOVE LIT-FPCRECE1           TO COD-TABLA-ERR-QPIPCCAB     23.05.16
002458        MOVE LIT-PARRAFO-9100       TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
002459        PERFORM 9000-ERROR-FICHERO                                23.05.16
002460                                                                  23.05.16
002461     END-IF.                                                      23.05.16
002462                                                                  23.05.16
002463******************************************************************23.05.16
002464* 9300-CHECK-FS-SALIDA1                                          *23.05.16
002465* SE COMPRUEBA QUE EL FILE STATUS DEL FICHERO SEA CORRECTO       *23.05.16
002466* SI NO ES ASI, SE INFORMA DEL ERROR Y SE CANCELA EL PROGRAMA.   *23.05.16
002467******************************************************************23.05.16
002468                                                                  23.05.16
002469 9300-CHECK-FS-SALIDA1.                                           23.05.16
002470                                                                  23.05.16
002471     IF FS-FPCRECS1 NOT EQUAL LIT-FS-00                           23.05.16
002472                                                                  23.05.16
002473        MOVE FS-FPCRECS1    TO CRT2-COD-FILESTATUS                23.05.16
002474        MOVE LIT-FPCRECS1   TO CRT2-NOM-FICHERO                   23.05.16
002475                                                                  23.05.16
002476        PERFORM 9999-FIN-ERROR                                    23.05.16
002477                                                                  23.05.16
002478        MOVE FS-FPCRECS1            TO COD-AVIERROR-QPIPCCAB      23.05.16
002479        MOVE LIT-FPCRECS1           TO COD-TABLA-ERR-QPIPCCAB     23.05.16
002480        MOVE LIT-PARRAFO-9300       TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
002481        PERFORM 9000-ERROR-FICHERO                                23.05.16
002482                                                                  23.05.16
002483     END-IF.                                                      23.05.16
002484                                                                  23.05.16
002485******************************************************************23.05.16
002486* 9400-CHECK-FS-SALIDA2                                          *23.05.16
002487* SE COMPRUEBA QUE EL FILE STATUS DEL FICHERO SEA CORRECTO       *23.05.16
002488* SI NO ES ASI, SE INFORMA DEL ERROR Y SE CANCELA EL PROGRAMA.   *23.05.16
002489******************************************************************23.05.16
002490                                                                  23.05.16
002491 9400-CHECK-FS-SALIDA2.                                           23.05.16
002492                                                                  23.05.16
002493     IF FS-FPCRECL1 NOT EQUAL LIT-FS-00                           23.05.16
002494                                                                  23.05.16
002495        DISPLAY 'CRT2-COD-TIPO-ERROR :' LIT-E                     23.05.16
002496        DISPLAY 'CRT2-COD-ERROR      :' CTE-1                     23.05.16
002497        DISPLAY 'CRT2-COD-PROG-ERR   :' LIT-PROGRAMA              23.05.16
002498        DISPLAY 'CRT2-COD-PARR-ERR   :' CRT2-COD-PARR-ERR         23.05.16
002499        DISPLAY 'CRT2-NOM-FICHERO    :' LIT-FPCRECL1              23.05.16
002500        DISPLAY 'CRT2-COD-FILESTATUS :' FS-FPCRECL1               23.05.16
002501        DISPLAY 'CRT2-DES-ERROR      :' CRT2-DES-ERROR            23.05.16
002502                                                                  23.05.16
002503        MOVE FS-FPCRECL1            TO COD-AVIERROR-QPIPCCAB      23.05.16
002504        MOVE LIT-FPCRECL1           TO COD-TABLA-ERR-QPIPCCAB     23.05.16
002505        MOVE LIT-PARRAFO-9400       TO COD-PARRAFO-ERR-QPIPCCAB   23.05.16
002506        PERFORM 9000-ERROR-FICHERO                                23.05.16
002507                                                                  23.05.16
002508     END-IF.                                                      23.05.16
002509                                                                  23.05.16
002510******************************************************************23.05.16
002511* 9999-FIN-ERROR                                                 *23.05.16
002512* SE INFORMAN LOS CAMPOS DE LA COPY DE ERRORES                   *23.05.16
002513******************************************************************23.05.16
002514                                                                  23.05.16
002515 9999-FIN-ERROR.                                                  23.05.16
002516                                                                  23.05.16
002517     MOVE LIT-ALPHA-1       TO CRT2-COD-ERROR                     23.05.16
002518     MOVE LIT-E             TO CRT2-COD-TIPO-ERROR                23.05.16
002519     MOVE LIT-PROGRAMA      TO CRT2-COD-PROG-ERR                  23.05.16
002520                                                                  23.05.16
002521     PERFORM 6300-GRABAR-ERROR                                    23.05.16
002522     .                                                            23.05.16
002523                                                                  23.05.16
002524******************************************************************23.05.16
002525* 6300-GRABAR-ERROR                                              *23.05.16
002526* SE GRABA EL FICHERO DE INCIDENCIAS.                            *23.05.16
002527******************************************************************23.05.16
002528                                                                  23.05.16
002529 6300-GRABAR-ERROR.                                               23.05.16
002530                                                                  23.05.16
002531     WRITE REG-FPCRECL1 FROM CRT2-CDSPCRT2                        23.05.16
002532                                                                  23.05.16
002533     MOVE LIT-6300                   TO CRT2-COD-PARR-ERR         23.05.16
002534     MOVE LIT-ERROR-ESCRITURA3       TO CRT2-DES-ERROR            23.05.16
002535                                                                  23.05.16
002536     PERFORM 9400-CHECK-FS-SALIDA2                                23.05.16
002537                                                                  23.05.16
002538     INITIALIZE CRT2-CDSPCRT2                                     23.05.16
002539                                                                  23.05.16
002540     ADD CTE-SUMA-1                  TO CONT-ERRORES              23.05.16
002541     .                                                            23.05.16
002542                                                                  23.05.16
002543******************************************************************23.05.16
002544 9000-ERROR-FICHERO.                                              23.05.16
002545*    DISPLAY '9000-ERROR-FICHERO.'                                23.05.16
002546*                                                                 23.05.16
002547     MOVE LIT-F                  TO XTI-AVIERROR-QPIPCCAB         23.05.16
002548     MOVE LIT-PROGRAMA           TO COD-MODULO-ERR-QPIPCCAB       23.05.16
002549*                                                                 23.05.16
002550     PERFORM 9999-ERROR-GENERAL                                   23.05.16
002551     .                                                            23.05.16
002552                                                                  23.05.16
002553******************************************************************23.05.16
002554*                      9999-ERROR-GENERAL                        *23.05.16
002555******************************************************************23.05.16
002556 9999-ERROR-GENERAL.                                              23.05.16
002557*    DISPLAY '9999-ERROR-GENERAL.'                                23.05.16
002558*                                                                 23.05.16
002559     MOVE LIT-PROGRAMA           TO COD-PROGRAMA-QPIPCCAB         23.05.16
002560     MOVE LIT-APLICACION         TO COD-APLICACI-QPIPCCAB         23.05.16
002561                                                                  23.05.16
002562     MOVE LIT-S                  TO XTI-ENTSAL-QPBTCXRR (CTE-1C)  23.05.16
002563     MOVE LIT-FPCRECS1           TO COD-ORIGEN-QPBTCXRR (CTE-1C)  23.05.16
002564     MOVE LIT-DES-FPCRECS1       TO DES-ORIGEN-QPBTCXRR (CTE-1C)  23.05.16
002565     MOVE CONT-GRABADOS1         TO QNU-PROCES-QPBTCXRR (CTE-1C)  23.05.16
002566     MOVE ZEROES                 TO QNU-DESCART-QPBTCXRR(CTE-1C)  23.05.16
002567                                                                  23.05.16
002568     MOVE LIT-S                  TO XTI-ENTSAL-QPBTCXRR (CTE-2C)  23.05.16
002569     MOVE LIT-FPCRECL1           TO COD-ORIGEN-QPBTCXRR (CTE-2C)  23.05.16
002570     MOVE LIT-DES-FPCRECL1       TO DES-ORIGEN-QPBTCXRR (CTE-2C)  23.05.16
002571     MOVE CONT-ERRORES           TO QNU-PROCES-QPBTCXRR (CTE-2C)  23.05.16
002572     MOVE ZEROES                 TO QNU-DESCART-QPBTCXRR(CTE-2C)  23.05.16
002573                                                                  23.05.16
002574     CALL LIT-QPBTRXRR USING R-QPIPCCAB                           23.05.16
002575                             R-QPBTCXRR                           23.05.16
002576     .                                                            23.05.16
002577*                                                                 23.05.16
002578                                                                  23.05.16